{
    "id": "ML1333",
    "mood": "happy",
    "artist": "Janina",
    "title": "Nachts um halb drei",
    "song": {
        "_type": "song",
        "annotation_count": 9,
        "api_path": "/songs/3688197",
        "artist_names": "Fabi Bang (YouTuber)",
        "full_title": "Surprise Motherfucker by Fabi Bang (YouTuber)",
        "header_image_thumbnail_url": "https://assets.genius.com/images/default_cover_image.png?1679675825",
        "header_image_url": "https://assets.genius.com/images/default_cover_image.png?1679675825",
        "id": 3688197,
        "instrumental": false,
        "language": "de",
        "lyrics_owner_id": 6229011,
        "lyrics_state": "complete",
        "lyrics_updated_at": 1525139794,
        "path": "/Fabi-bang-youtuber-surprise-motherfucker-lyrics",
        "pyongs_count": 3,
        "relationships_index_url": "https://genius.com/Fabi-bang-youtuber-surprise-motherfucker-sample",
        "release_date_components": {
            "year": 2018,
            "month": 5,
            "day": 1
        },
        "release_date_for_display": "May 1, 2018",
        "release_date_with_abbreviated_month_for_display": "May. 1, 2018",
        "song_art_image_thumbnail_url": "https://assets.genius.com/images/default_cover_image.png?1679675825",
        "song_art_image_url": "https://assets.genius.com/images/default_cover_image.png?1679675825",
        "stats": {
            "unreviewed_annotations": 9,
            "hot": false
        },
        "title": "Surprise Motherfucker",
        "title_with_featured": "Surprise Motherfucker",
        "updated_by_human_at": 1574604527,
        "url": "https://genius.com/Fabi-bang-youtuber-surprise-motherfucker-lyrics",
        "featured_artists": [],
        "primary_artist": {
            "_type": "artist",
            "api_path": "/artists/2025246",
            "header_image_url": "https://assets.genius.com/images/default_avatar_300.png?1679675825",
            "id": 2025246,
            "image_url": "https://assets.genius.com/images/default_avatar_300.png?1679675825",
            "index_character": "f",
            "is_meme_verified": false,
            "is_verified": false,
            "name": "Fabi Bang (YouTuber)",
            "slug": "Fabi-bang-youtuber",
            "url": "https://genius.com/artists/Fabi-bang-youtuber"
        },
        "artist": "Fabi Bang (YouTuber)",
        "lyrics": "Surprise Motherfucker Lyrics[Intro]\n„Yo, Lee, hört man, dass ich krank bin? Egal, morgen, morgen Master-Abgabe, ne? Der hier muss noch drauf! Dass ist für dich David. Zu deinem Geburtstag. N' bisschen verspätet, aber besser später als nie!\n\n[Part 1]\nDas ist für den Bruder, der Conny den \"Ich bin feucht\" Snap schickte kurz nachdem ich sie auswahl und ihr ihn ausversehen schickte\nIm Sommer gibt's in deiner Hütte Barbecue, und ich weiß jedes meiner Geheimnisse ist sicher bei dir, wie \"Fara und Fu\"\nWir betrachten unsere Pokale; schmeißen uns bei Business Terminen in Schale, wie die Benz Schlüssel wenn wir nach Hause kommen\nDanach wird erst mal im hauseigenen Pool geschwommen. Du bist immer für mich da, brauch ich Rat komm' ich zu dir. Mit 18 gehen wir zu deiner Oma und bald kannst auch du, zum Barbier.Uns wurden schon genügend Zeichnen gegeben, es steht außer Frage wir sind Brüder für's Leben. Mit dir verbringe ich meine letzten Tage. Für den Fall dass du in' Knast musst, weißt du deiner Frau und Kindern geht es gut bei mir. Deine Kinder bekommen Mäntel aus Kashmir. Deiner Frau gehört der ganze juwelier, und das ganze mache ich \"avec plaisir\". Von Kanada nach Finnland kommen sie in meinem Privat Jet, dass finden sie fett, wie den Mustafa Muhammed. Dem seine Kehle wird durchtrennt , und du weißt von deinem Geld fehlt kein Cent. Denn das geht alles auf meinen Nacken, wie meine Goldketten, ran an die Bouletten!\n\n[Hook]\n\"Baby Shirak\". David feiert seinen Geburtstag. Du bist bald in Jasina drinn'. Sie wird deine Freundin. Sie sagt :\"Keinen Sex vor der Ehe, ich bin helal\" .Ihr Keuschheitsgürtel aus Metall. Doch bei so nem' Typen wie dir, ist alles im Lot, da haben sich die Anforderungen schnell verflogen, wie n' Amateur Pilot\nIch kauf' dir das Lenkrad, dann wirst du Trucker. T.T.T. ; legendary; \"Surprise motherfucker!\"\n[Part 2]\nUnsere Konten sind fett bestückt, wie die 747 von Galileo. Wir schauten sein Video zur selben Zeit, sowas ist bei uns keine Seltenheit. Ich studier' Chemie und bin in der Materie, wie der Konflikt mit Pakistans Infanterie. Wir ficken alles was nicht bei drei auf m' Baum ist ,wie ein Koalabär. Bitch, wir sind legendär und mit 20 schon Milliardär. Wir cruisen auf unserer Yacht im Mittelmeer. Und haben brasilianische Bitches an Bord, wie ein Karnevalswagen von den du Opfer geil wirst, wie von Susana Almeidas Wettervorhersagen\nMeine Schwester kam nachts um zwei bei T.T.T. oft in mein Zimmer rein, hab' ich mein Führerschein, hol' ich dich immer ab. Ömer auf mein' Döner bitte kein Ketchup!\nSpaß Brudi, ich hab dich lieb auch wenn ich manchmal übertrieb. Ich verzeih' dir alles, und könnte dir nie böse sein. Wer dich anstresst, dem sein Kopf landet auf dem Bordstein!\n\n[Hook]\n\"Baby Shirak\". David feiert seinen Geburtstag. Du bist bald in Jasina drinn'. Sie wird deine Freundin. Sie sagt :\"Keinen Sex vor der Ehe, ich bin helal\" .Ihr Keuschheitsgürtel aus Metall. Doch bei so nem' Typen wie dir, ist alles im Lot, da haben sich die Anforderungen schnell verflogen, wie n' Amateur Pilot\nIch kauf' dir das Lenkrad, dann wirst du Trucker. T.T.T. ; legendary; \"Surprise motherfucker!\"You might also like3Embed"
    }
}