{
    "id": "ML1434",
    "mood": "relaxed",
    "artist": "The Ohio Players",
    "title": "I Want To Be Free",
    "song": {
        "_type": "song",
        "annotation_count": 2,
        "api_path": "/songs/3343655",
        "artist_names": "Lou Reed",
        "full_title": "Walk On the Wild Side [Live: Take No Prisoners] by Lou Reed",
        "header_image_thumbnail_url": "https://images.genius.com/203a797922bac1b3320263bf1e8e4d85.300x300x1.jpg",
        "header_image_url": "https://images.genius.com/203a797922bac1b3320263bf1e8e4d85.500x500x1.jpg",
        "id": 3343655,
        "instrumental": false,
        "language": "en",
        "lyrics_owner_id": 5501811,
        "lyrics_state": "complete",
        "lyrics_updated_at": 1642895368,
        "path": "/Lou-reed-walk-on-the-wild-side-live-take-no-prisoners-lyrics",
        "pyongs_count": null,
        "relationships_index_url": "https://genius.com/Lou-reed-walk-on-the-wild-side-live-take-no-prisoners-sample",
        "release_date_components": {
            "year": 1978,
            "month": 11,
            "day": 1
        },
        "release_date_for_display": "November 1, 1978",
        "release_date_with_abbreviated_month_for_display": "Nov. 1, 1978",
        "song_art_image_thumbnail_url": "https://images.genius.com/203a797922bac1b3320263bf1e8e4d85.300x300x1.jpg",
        "song_art_image_url": "https://images.genius.com/203a797922bac1b3320263bf1e8e4d85.500x500x1.jpg",
        "stats": {
            "unreviewed_annotations": 1,
            "hot": false
        },
        "title": "Walk On the Wild Side [Live: Take No Prisoners]",
        "title_with_featured": "Walk On the Wild Side [Live: Take No Prisoners]",
        "updated_by_human_at": 1642895368,
        "url": "https://genius.com/Lou-reed-walk-on-the-wild-side-live-take-no-prisoners-lyrics",
        "featured_artists": [],
        "primary_artist": {
            "_type": "artist",
            "api_path": "/artists/13277",
            "header_image_url": "https://images.genius.com/62d10ecbf09c1d1fa8c82da87d5f9e98.650x430x1.jpg",
            "id": 13277,
            "image_url": "https://images.genius.com/0a0483c5ccf248d1ff1835dcb0e1f148.400x400x1.jpg",
            "index_character": "l",
            "is_meme_verified": false,
            "is_verified": false,
            "name": "Lou Reed",
            "slug": "Lou-reed",
            "url": "https://genius.com/artists/Lou-reed"
        },
        "artist": "Lou Reed",
        "lyrics": "Walk On the Wild Side [Live: Take No Prisoners] Lyrics[Lou Reed]\nWe had some kind of a nut here the other night man\nThere was no place to put the fucking glass\nSo like I put it on the floor\nBecause I didn't want to get the fucking piano dirty\nBecause it costs so fucking much\nThere's a lunatic out there who comes after the show says\n\"I wanna talk to that fucking Reed man\nWhy'd he throw a cup at his Roadie\"\nFive cops and he hits a cop\nGee man, what an asshole\nHey! And he has his brother here right\nAnd he punches a cop, oh man\nI want to talk to Lou about the answer to life\nAnd why, why are you booing me?\nSo next time your wondering, and I don't live that far from here\nLike I can say \"Wow man\" I get out of the limo and there's going to be the dragon with a cape saying \"All your sins and then some.\"\nAnd I say \"But I'm not Catholic Jack\"\nThe Umbrella man is on Rikers Island studying to be a dentist\nYou remember him? With the cape?\n[Audience Member]\nHey Lou!\n\n[Lou Reed]\nWhat?\nSuprise you huh?\nWhat you think this is question and answer?\n[?]\nIt's not my fault man\n28,000 years ago come on, come on, come on\nI don't have anything to say\nI just want it to be quiet I've been here a week\nYou think that's an accomplishment?\nI think that's something you're sentenced to\nAnd if you don't get that, you get to play here [?]\n2 hours with 14,000 animals throwing beer cans at you\nAh, but that's Rock'n'roll bullshit\nNot behind my back it ain't\nI stand corrected Michael\n\nWe know the rhythm come on\nAin't a metronome\nDon't you show any passion\nIf you'd show any emotion I'd fire you\nI am not sure, we did this song all week and\nIt's not like I don't want to play your favorites it's just...\nThere's so many favorites to choose from\nNo?\nThe thing is I was so sick of that song\nAnd I don't get sick of my own songs, I like my own songs\nSo, we hadn't done her in a while\nBut it's only doing it at night\nAnd It's not cause I like it, It's cause I'm not bored with it\nEverybody gets bored of somebody sometimes\nExcept me, I'm lonely\nMe and my several selves discuss it at night\nLou #1 and Lou, Lou #5\nHello\nIs that you again? Reformer\nMea Culpa\nYou might also likeHolly came from Miami F.L.A\nI have no attitude without a cigarette\nI'd rather have cancer than be a faggot\nThat wasn't an anti-gay remark\nComing from me man that's a compliment\nLike going to bed with a brontosaurus, man\nIt's out of style, Whats its style?\nNothing is its style man\nHave you gotten into nothing yet?\nWhy not, cause its nothing\nSaturday night man where do you want to go\nWatch me turn into Lou Reed before your very eyes!\nAhhh\nI do Lou Reed better than anybody!\nSo I thought I'd get in on it\nEnough attitude to kill every person in Jersey\nAsk him if it's scientific\n\nHolly came from Miami F.L.A\nHitchhiked, hitchhike - All the way across the U.S.A\nPlucked her eyebrows along the way\nShaved her legs and said he was a she\nAnd then she said\n\"Why don't you take a walk on the wild side?\"\n\"Why don't you take a walk on the wild side?\"\nWould you like to know how that song got written?\nI know you'd been dying to ask\nDoes that sound like Holly Woodlawn? That's an in-joke I guess\nBelieve it or not, the first time I quit Rock'n'roll\nBecause of too many lawsuits\n'Cause I could not afford my lawyers\nI still can't but now I got the government as partners\nFantastic, I get the government, like a week, you know\nIn Puerto Rico, in a nice hotel\nAnd your like what are you complaining about asshole?\nI just play guitar man\n\nHi Bruce\n\nSpringsteen is alright, by the way\nHe gets my seal of approval, I think he's groovy\nYou notice the way the critics turned on him\nLike after they were on him right?\nWhen he needed him, they weren't there\nCritics\nWhat does Robert Christgau do in bed?\nYou know, is he a toe-fucker?\nMan, anal-retentive—The Consumer’s Guide to Rock?\nWhat a moron!\nA Consumer’s Guide to Rock, man! I object to the fucking liner notes\nStart studying rock ‘n’ roll? I can’t believe it\n“Baroque Rock: A Study by Robert Christgau.”\nJohn Rockwell, man. Wow!\nYou know how heavy it is to get reviewed by Rockwell\nAnd he says you’re intelligent?\nFuck you! I don’t need you to tell me that I’m good\n“Mr. Reed.”\nYou know, you say\n“Oh, man, I’m in The New York Times\nIt said ‘Mr. Reed.’”\nFuck you!\nYour doorman wouldn’t kiss my ass, man, I don’t give a jackal\nHe, right, he studies at Harvard, right monologue\nBut dig this, man, opera!\nA fucking opera guy, man!\nAnd that’s the critic for The New York Times that makes and breaks the best rock bands that are very heavy and intelligent\nNotice there are no colored rock groups?\nCertainly not in The New York Times with John Roberts\nHe wouldn’t go there, man, he comes to CBGB’s with an armed guard\n- Don’t touch me, man. And he’s a big dude\nSomebody should say, “John, don’t be afraid.”\nAnd Christgau is like an anal-retentive\nNice little boxes. “B-plus.” Can you imagine working for a fucking year and you got a B-plus from an asshole in The Village Voice?\nAnd you don’t gotta take this shit\nYou don’t have to talk to the fucking journalists, man. And they get in for free, and the best seats, in case you’re interested\nAnd there’s no way we can do anything about it\nThe club owners want the good review\nSo you get the asshole right up front, looking bored\nHe’s going, “When is this shit over, Marty? You got some coke?\nOh, boy. Anyway, I know you’re not interested in my problems\nNeither am I\n\nCandy came from out on Massapequa, Long Island\nThis is true! this is true! believe me\nOh wow is that true\nIn the backroom, she is everybody's darling\nWent to a brothel and [?]\nAnd when she was giving you the greatest head\nEven when she was giving ya the greatest head\nThere was nothing Candy ever said but\n\"Hey babe, Why don't you come out and take a walk on the wild side.\"\nI really miss Candy, and I didn't even know her that well\nI'm such a scam artist\nShe had leukemia from a silicone tit, and I'm supposed to feel sorry?\nMan! then don't fucking do that!\nDon't you know, have health education?\nDon't put plastic in your fucking tit\nYou got no heart, man I don't have enough heart for 14000 assholes\nBut I got enough for you! Oh Really?\nYou're almost as boring as you look, thanks\nYou look like a democrat, wanna go to bed?\n\nHey Little Joe\nLittle Joe is an idiot, I don't know if any of you know that\nHere is this guy like this\nYou talk to him for like 2 minutes\nAnd you realize he has an IQ of like 12\nSo like he is the only guy I know who went to Italy to be a movie star\nAnd It's not happening\nI mean everybody is ready to go to bed with him and make him a star\nYou know he can barely tie his shoelaces\nAnd I know Einstein couldn't tie his shoelaces but it's not like that!\nNot even close man\nYou know he just sits and watches the [?]\nThey say Joe your getting old, and he says\n\"I know\"\n\"I'll make a Warhol film,\"\nBut you can't do that anymore, man\nAndy has taken himself away from us\nAnd he's right, now I know why he did it!\nSo, Drella, if you're there: I'm very glad that you're around\nBut man, how, how- Catherine you're there\nHe went to see Monique van Vooren\nWhat did she do, sack? Late Show?\nMonique van Vooren, she has Gore Vidal as a watch\nHim and Mailer\nYou know, I met Mailer at a party, he tries to punch you in the stomach to see how tough you are\nHe's pathetic, you know\nLike \"C'mon, man\" and he's like \"What?\"\nYou gotta be kidding!\nSomebody step on him, man\nGo write a bible\n\nAnyway, interesting people Sugar Plum Fairy\nHit the street\nSugar Plum Fairy\nNow the person who loved the Sugar Farm Fairy\nIs the terrible alright?\nA real terror, she was fired from the New Yorker\nAnd corrected Dorothy Parker's prose\nCan you imagine\nFor those of you who still read: what a snotty remark, I know\nAnyway\nShe makes her living writing things for the Encyclopedia Brittanica\nFive cents a word, like last time I saw her she, she\nMichael, she, she was doing the flower section in Africa\nDelilahs in Africa, yeah\nShe said: what is the word that will make this thing interesting\nWe call her Tiny Malice, Dorothy Dean\nOh man, two drinks and she lays you out\nI threw a dish at her like filled with cigarettes on Thanksgiving\nJust 'cause she was getting ready to say, mm\nShe wouldn't come to see me if I was dying\nJackie, Jackie Curtis, this was revelations\nRemember that play, like, you know players are ridiculous?\nAahh, yes started that whole thing out at Rocky Horror shit\nAnd all that bullshit\nOohh man, don't you know, and I guess you don't, it's not your fault\nIt's the journalists, those fucking journalists\nWhy don't we shoot those journalists\nYou don't need those assholes, why do you let them go in here free?\nWhy don't you bitch or something, go to another club, yeah\nI don't believe you take this shit\nAnyway, I will run for office next week\nAnd I wouldn't vote for me on a prayer\n\nI'm not trusted, but Jackie, and I know, she's just speeding away\nThought like me, hey I'm Jimmy Dean for a day, what, what\nBut you know that she had to crash\nAnd some Valium had helped that bash\nWhat do I use now Dilaudid, right, ten grams for a headache\nEight, eight dollars in Ohio, right, here it is like fifty-five\nUnless you go to Chinatown, they bite your nose off\nHey, you need something for pain?\n\nAnd then the colored girls, they walk over, guess what they said\nDoo, doo, doo, doo, doo, doo, doo, doo, doo\nWait, baby\nI was gone tell you how I came to write a song\nCalled 'Walk on the Wild Side'\nI did not think of it myself\nRight, that's how I got on this one\nI had walked out\nJust when I made an album called Loaded For Loaded\nYeah, that's right\nBecause I saw it coming\nAnd said oh-oh, get lost, so I walked, right\nBecause we were gonna be very successful\nAnd there could be money there and\nThese are my rounds\nSo I became a typist for my old man\nForty dollars a week, he says stupid\nI said yeah, but I never said I was smart\nI don't want the company man, you know\nI have had two jobs, one's with a guy in Jones Beach\nYou know the stick with the pin\nLasted one day, a guy threw an orange peel down here in the trash\nI say you gotta be kiddin' man, I got a stick with a pin in it\nSo he put me in the pool area, the guy who walks around\nWhen you put your stuff, like in the fucking chair\nAnd they say:\nIf you leave and don't take your stuff with you, we throw it in the water\nThat was an afternoon\nI said: what do you say, can't you read the sign? I was one of them\nWow, that was\nI was shocked\nI was appalled\nI WAS TAKEN ABACK!\nAND THEN HE SAW!\nSo, the guys who did the threepenny opera, this is all true\nCall me up, of all things they say:\nWe think you are a very literate rock 'n roll person\nAnd after Ray Davies\nWe think that you are the person that could take Nelson Algren's\nBook Walk On The Wild Side\nAnd do like a musical thing for all of Broadway\nI said, I said, you gotta be kiddin'\nIt's about cripples in the ghetto!\nMan, what are you, out of your mind?\nThey said: oh but, you know--\nVery serious intense forty-ish hippies, like gray hair\nPark Avenue Apartments--\nI'm a fucking typist at this point\nYou gotta understand man\nPeople saying: oh Lou you're so-\nThese assholes wanna treat me for a book that's about cripples?\nI'm the best-qualified person to write a book\nAbout cripples in music?\nKill yourself, man, that's better than being a garage mechanic, I think\nAs long as I keep thinking that, you know, and why, what's the truth\nI keep saying the genie will appear and say \"Hey Schmuck!\" It was really groovy all the time being that garage mechanic out in Icelight\nAnd I would say, oh wow\nWhy didn't you tap me on the shoulder\nBecause you wouldn't listen\nFair enough\nSo they give, they\nThey say go buy a paperback version\nAnd they didn't even give me a version\nI said, \"Is it abridged?\"\nOh, the movie with Jane Fonda\nThey said then: now you got it\nI like to look at Jane Fonda, don't wanna hear her\nNow I don't even want to look at her, you know\nI don't like the sensitive lesbian pictures\nLook, I, I don't relate, you know, backward I don't relate\nAnd facing front is hopeless\nSo I read this fucking book, and I\nThey said:\nWill you make an X where you think the song should go, haha\nThe cripple goes to the bathroom, oh, oh yeah, cripple cripple\nI, I got jammed for a few times, I had nothing to say to them\nSo then it became a challenge, so I figured\nWhy don't I write the theme song for Walk On The Wild Side\nI call it Walk On The Wild Side, that's smart\nSo I had a great time with nothing to write about\nThis stupid fucking book, man\nEverybody says the guy is brilliant, I said: he's from Chicago\nSaul Bellow, oh\nSo anyway, then they got Mahogony, that, that play that flopped\nDiana Ross getting\nDiana Ross, by the way, is great, as a person\nShe hasn't any good record at the time\nLove Hangover is not\nShe says [?] that's more than you do\nSo anyway, I had a great title\nAnd nothing else, and then they fired me\nI mean they did it really gently\nThey let me down easily and they said\nLou, man, we've got a chance to produce Mahogany on Broadway\nI said: oh wow, am I crushed\nHa, break a leg, I read that book, go get them, man, look\nAdvance the theatre, haha\nBruce, you got to believe me, man, these, these people exist\nTill the play bombed\nBecause assholes like Robert Christgau said it was terrible\nAnd in this case it was\nAnd I wouldn't go in the first place\nBut there I was writing the song for these assholes\nAnyway, so then, I had a great time writing, I figured\nI will save this title for the day I decided to solve the world\nNew York, so I did themEmbed"
    }
}