{
    "id": "ML1637",
    "mood": "relaxed",
    "artist": "The Constructus Corporation",
    "title": "I'll See You Now Now",
    "song": {
        "_type": "song",
        "annotation_count": 3,
        "api_path": "/songs/3057052",
        "artist_names": "Constructus Corporation",
        "full_title": "Ripples in the Mesh - The Radioplay by Constructus Corporation",
        "header_image_thumbnail_url": "https://images.genius.com/10ee0b685f8fba79b70b798cabd1c356.300x300x1.jpg",
        "header_image_url": "https://images.genius.com/10ee0b685f8fba79b70b798cabd1c356.700x700x1.jpg",
        "id": 3057052,
        "instrumental": false,
        "language": "en",
        "lyrics_owner_id": 4470833,
        "lyrics_state": "complete",
        "lyrics_updated_at": 1600736010,
        "path": "/Constructus-corporation-ripples-in-the-mesh-the-radioplay-annotated",
        "pyongs_count": null,
        "relationships_index_url": "https://genius.com/Constructus-corporation-ripples-in-the-mesh-the-radioplay-sample",
        "release_date_components": {
            "year": 2002,
            "month": 1,
            "day": 1
        },
        "release_date_for_display": "January 1, 2002",
        "release_date_with_abbreviated_month_for_display": "Jan. 1, 2002",
        "song_art_image_thumbnail_url": "https://images.genius.com/10ee0b685f8fba79b70b798cabd1c356.300x300x1.jpg",
        "song_art_image_url": "https://images.genius.com/10ee0b685f8fba79b70b798cabd1c356.700x700x1.jpg",
        "stats": {
            "unreviewed_annotations": 0,
            "hot": false
        },
        "title": "Ripples in the Mesh - The Radioplay",
        "title_with_featured": "Ripples in the Mesh - The Radioplay",
        "updated_by_human_at": 1649160586,
        "url": "https://genius.com/Constructus-corporation-ripples-in-the-mesh-the-radioplay-annotated",
        "featured_artists": [],
        "primary_artist": {
            "_type": "artist",
            "api_path": "/artists/11705",
            "header_image_url": "https://images.genius.com/c32c6ece8cb673fc9e0b65b77ad377aa.631x514x1.png",
            "id": 11705,
            "image_url": "https://images.genius.com/f131df09446cc9e2b60905e2cb174554.220x220x1.png",
            "index_character": "c",
            "is_meme_verified": false,
            "is_verified": false,
            "name": "Constructus Corporation",
            "slug": "Constructus-corporation",
            "url": "https://genius.com/artists/Constructus-corporation"
        },
        "artist": "Constructus Corporation",
        "lyrics": "Ripples in the Mesh - The Radioplay Lyrics[Documentary style commentator]\n\nThey have visited us from the dawn of time. And one can always read the signs. Their rebirth into our world is always coursed with famine, plague and death. Their latest manifestation, which seems to have been the most powerful, happened in the midst of 20th century depression in Central America. A child suffers from terrible nightmares. Nightmares that was so fiercely overwhelming that they became, aware of themselves.\n\nAnd they could even experience our realm through a lucid state. They learn to manifest themselves.  And they studied, and watched, and schemed. Then grew and grew stronger and grew greater till they finally announced their arrival to the world AS! ...\n\n…A highly successful multi-billionaire dollar soda pop industry.\n\nAnd their overwhelming success was so magnificent, so unnervingly final, that they soon heaved more power and capital than any country worth mentioning. And they were eccentric, and they would paint the clouds and grow strange things and even scoop proud cities from the Earth, made to float and follow the golden sun!\n\nThe Constructus Corporation presents: the Ziggurat.\n[Narrator]\n\nThe Ziggurat, a giant floating megalopolis of comfortable living, housed four autonomous societies and over a billion people. It was filled with more exciting personalities than a pomegranate is of pips! But for now, consider these two boys:\n\nFirst: Randomboy -- A tight young MC and a natural leader, who in time would change the world for ever.\n\nAnd secondly: his best friend, the Kidtronic.\n\nNow, when studying Kidtronic it is vitally important to consider the following: him and his sister were orphans, and were raised by virtual parent personalities supplied by Constructus. Uhm, now. At the age of seven, he had re-written their program instructions and changed the parental shapes from loving moms and dads into two big fluffy bears that generally just acted silly and entertained his baby sister Anica.\n\nAt the age of 8 and a half, he was arrested by the Constructus assistants for the first time. His crime? He had hi-jacked two sprinter wet-wires servers and was using them to embezzle third-decimal credit to his sister's favorite virtual celebrities. It was the first in a series of five arrests.\n\nNow, as you'd probably noticed, he was a complete genius\nwith all the tech- and cyber-reality. Kidtronic also designed games for devices called \"playgrounds,\" which covered your eyes and ears.\n\nHe was also paid annual tributes by all the banks in the Ziggurat for not bankrupting them.\n\nNow c’mon! Let's see what he's up too. Oh! He's sleeping. Dreaming. Changing, into what he will soon become.\n\n\n[Kidtronic dream]\n\nZzZzZzZzZzZzZzZzZzZz\n\nWait were am I? Breakfast table. Before school. A Mom and a dad. Anica. She's feeding us eggs. I don't wanna eat eggs. My dad's on the table. ARGH! He's cutting my hand. ARGHGHGG! My Brain! Uh uh uh uh uh!\n[Narrator]\n\nAlmost at that precise moment, thirteen years before, in a secret hide-away 3 kilometers under the Himalayas, the CEO of Constructus International, a certain Mr. Kiriaku was in a meeting with the eyeless, prophet-witch named \"Next\"\n\n[Next in “” and Mr. Kiriaku in ( )]\n\n“Ahhhhhhhhh”\n(Tell me what you see?)\n“Ah hahhafghghghha ! Lord. There will be danger ahg …”\n(Danger ?)\n“Ehh”\n(What? What is its source?)\n“Too much static uirghghg. Disturbance.”\n(Speak, Next. What is the threat?)\n“Lord it is fast. Thirteen years from this moment.”\n(Thirteen years...Thirteen years!? What is its face? Where will it come from?)\n“Lord, it seems to be invisible. All I can make out is... ripples. Ripples in the Mesh.”\n(Well then find it Next!)\n“I cannot, the pattern that the chaos weaves is too frantic, too - rand- AURGH”\n\n“One will rise that will earn friends… The [?] time [?], and your blood [?]”\n\n(Prophet enough! An invisible threat. Thirteen years from now. Capable of wiping Constructus off the face of the Earth? A mere random ripple in The Mesh that threatens me, a god! What created light, our light that cripples radiance! To be snuffed by a mere, random ripple in The Mesh?\nThen I will create our champion. Hahaha. Our own hideous weapon. And send him up to dwell amongst the humans and seek and destroy the ripple-maker)\n\n[Narrator]\nAnd that very same day, two children were born on two different places on the Ziggurat. One, to loving family; and other to a multi-national corporation. But right now back to our story\n\nKidtronic had woken up and was loading his new game \"Long Street\" onto his playground. He wanted to show it to his friend Randomboy. He was hoping that they might get a chance to play it on the way to the emceeing competition. He was feeling a little nervous because him and Randomboy had both entered the competition. It was very prestigious, and the biggest of its kind yet. At the moment, he was concentrating on the show, doing some breathing exercises when his sister entered the room, without warning.\n\n[Anica and Kidtronic]\n\n“BOO!\n\n“ARGH. Oh jeez, you scared the bejebus out of me. Don't do that.”\n\n“So, where you going huh 'Tronic?”\n\n“Nowhere.”\n\n“Yes you are! You're going to that emceeing competition aren't you?”\n\n“No I'm not.”\n\n“Ohoh ! Please can I come with you, PLEeeeeease!?”\n\n“No Anica, you're too young.”\n\n“I'm not! Please, I won't bug you I swear, I sweaaaaar!”\n\n“No”\n\n“I promise, I won't even stand close to you guys”\n\n“Anica stop, I said no and that's final. I'm leaving – Bye-bye”\n\n“Oh he's such a stupid punk. I hate him! He never takes me, anywhere! But I love you Mr. Rockadopolis”\n\n[Anica and Mr. Rockadopolis]\n\n“Uhm, yeah. I love you too Anica. I whip that kid's ass.”\n\n\"No! You mustn't Mr Rockadopolis. They shouldn't know that you're real. I hate him. Did you know that he suffers from epilepileptic... ehhhpelepileptic ... E-E-EPILEPILEPTIC seizures?! No, you wouldn't. Only me and Randomboy knows that. He doesn't want anybody to know. When they happen, he makes himself disappear. And I especially hate it when he disappears. Ah, forget him! I`m going.\"\n\n[Narrator]\n\nOn the way to Randomboy house…\n\n[In Kidtronic’s mind]\n\n\"He suffers from seizures\" [repeats many times,]\n“I am inside of you”\n“Jeez, what was that?”\n“I feel fine”\n“What is he becoming?”\n\n[Narrator]\nRandomboy opened his front door, and there stood Kidtronic, ridiculously punctual as usual.\n\n[Kidtronic, Randomboy, Anica, Narrator]\n\n“Yo, Randomboy,” said Kidtronic through his electronic telepathic interface.\n\n“Yo”\n\n“Check this out,” he continued, whilst downloading a game into Randomboy's playground. “I made this last night. It's called ‘Long Street’. I am the Ju-Ju man. You are Snufflegruff, which I still think is whack. You should make up your own-“\n\n“Hey man, interrupted Random Boy, we've been through this already.”\n\n“Yeah, well anyway, You must try and defeat me. Biter.”\n\n“Boo!”\n\n“Don't do that Anica!”\n\n“Yo, Randomboy! What’s up? Hey!”\n\n“Hey ‘sup Anica!”\n\n“Go home.”\n\n“No! I come with.”\n\n“No, go home. Go play with your dolls.”\n\n“I don't play with dolls!”\n\n“Then what is this. Hahahah.”\n\n“Mr Rockadopolis is not a doll! HE'S A MONSTER!”\n\n“Don't be so mean. Give the doll back to her.”\n\n“Hey look, Anica. we're gonna be performing so you can't hang with us. An’ there's gonna be too many people so, you can't go by yourself. But I know my grandma and some friends are going so...I mean, you can go with them.”\n\n“I can look after myself.”\n\n“No you can't.”\n\n“They're old! And I want to hang with you guys.”\n\n“No! No buts. We’re leaving. I'll see you later , Nics.”\n\n[Anica raps]\n\n“Those these guys think that I'm just some stupid little girl. I mean, Kidtronic wouldn't even let me play with the new game he made last night. Bong street or something. And now he won't even let me to come with! It's not fair! I take those punk dicks out any day at MC-ing\nYeah, watch me flipititititit...”\n\nSome of the characters in my dreams have nightmares\nWho took it upon themselves to trick me\nInto believing they were real\nNow I'm taking them out, one by one\nGorse monster play with prey just for fun, here we come!\nThree strange meta-morphing hoodoos\n'bout to rearrange, the realm of the nunus\nEverybody dudus, undo the voodoo\nLike Cookoo heh boo boo, good morning\nYou can’t fuck with the frequency\nIt’s squeaky clean, dream of me\nCreeping sneakily through your dream machine\nAnica the snuffling,\nchuckling, bubbling, snuggling, tugging, bugging ... unplugging,\nUgly fluffy-toy duckling, hugging sucklings\n\nI move in and out of bodies freely\nNobody can see me\nCreepy-crawly heebie-jeebie\nGetting all touchy-feely\nLa la la la la…\n\n“What the hell is that? Something strange is going on? Get away.”\n“I don't want you going in the woods again, yeah, I'm warning you.”\n\nThe people of Long Street lived very simple lives\nThey had wonderful natures, they were never impolite\nUp until the day the Ju-ju man, came to town\nnow check it out, as I break-it-down.\nMrs. Lekkerlegs. Was busy hanging her washing on the line\nSo, what happened next was definitively like the last thing on her mind\nAn unfamiliar voice behind her said: \"How do you do?\"\nErhm \"I'm very well thanks\" she replied \"but now, who are you?\"\nThe strange character in a top hat and a long black coat\nIntroduced himself politely, and then said \"on that note I'd like to show you another something that I doubt you've ever seen\nTake a look at this, beautiful machine\nThe strange little gadget started changing like magic\nAnd cleverly made its way up to the clothes line\nAnd in a blink of eye it removed the clothes, and span them around 'til they were dry\nAnd they all folded very neatly, in no time\nEummh some Mrs. Lekkerlegs was quite taken back\nVery curious about this mysterious character in black\nVery soon the whole town was making the scene\nAbout the Ju-ju man and his amazing machine\nSomething very, extra ordinary, is going to happen at the Long Street carnival\nDon't wanna tell you “what gives you that impression, he's crazy”\nSomething very, extra-ordinary is going to happen at the Long Street carnival\n“Wh-what you talkin' about?”\n\nThe next day the Ju-ju man went walking through town\nUnaware of what everybody was talking about\nHe had some time to kill before his appointment a little later with the mayor.\nSo he took this opportunity to socialize a bit\nAnd just between you and me the most surprising shit\nIt's about that spark, that strangest things have a habit of coming out the dark\nBut just when you expect them least umumu\nLies never rest in peace, anyway\nToday was kind like, quite an important day\nOh everybody has come to see the Ju-ju man special present for the mayor\nHe greeted crowd with a bow that open, his big fat sack. And that tack.\nPresented the mayor with a black backpack.\nEverybody standing round went oohhh !\nMayor put it on, and I was like \"ummhh. What does it do?\"\nAll of a sudden two long white arms with red button at the end, Extended at the end of the back-pack\nGrab a ‘hold of them my friend.\nThe mayor follow this instruction and felt the power surge\nAs the special metal wings emerged\nAnd everybody cried out with glee as The mayor took off clumsily, like a bumblebee\nSomething very, extra-ordinary is going to happen at the Long Street carnival\n“Wh-what you talkin' about?”\n“Keep an eye about that [?]”\n“You know whatever, I'm trying to do my work. Shut up”\nSomething very, extra-ordinary is going to happen at the Long Street carnival\n“Wh-what you talkin' about?”\n“Hey, hey, I'm here. How many times am I.. C'mon. C'mon man. Have some consideration.”\n\nNow meanwhile in the woods\n\nNow Snufflegruff called an important meeting with a boom-band\nSomething's fun is going on, we better do something about it soon man\nThere's a humongous metal fungus spreading\nand everyone's acting weird\nI'm just trying to think of all this\nWe're the only ones who can see it\nWe've gotta do something to get everyone’s attention\nand Hit them with our supernatural frequencies selections\nWe can build thing in the back of my Grandpa's Donkey-Kong.\nAnd take a nice cruise through town with a fat beats bumping hard\nBut we can call it, ummh, oi, the Long Street carnival\nCause I know that Ju-ju man is definitely up to, something horrible\nOk, we got, quite a lot of stuff to do so, c'mon let’s get busy\nThe big fish is about to get taken out by some crazy little fishes\n\n“Get ready, let's do this”\nThe big day arrived as advertised and everybody goes with the festive vibe\nIf the sun rose, the best the sky was shining extra bright.\nSnuffing [?] his mind mesmerized these humans with his magnificent vibrations\nEven some visitors from afar were like \"man, isn't this amazing\"\nThe speakers bumped, as the boom-band freaked the funk\nAnd all the smiling people feeling the song\nSinging along, without a care in the world all shouting and clapping\nAll entirely unaware of what was about to happen.\nSomething very, extra-ordinary is going to happen at the Long Street carnival\n\n“Oh listen old man, c'mon man you’re being a pain in the ass”\n“Can you please just, for one second”\nSomething very, extra-ordinary is going to happen at the Long Street carnival\n“Get out that, quick get out. I can't work with you here.”\n“That [?] please leave. Gaurds!”\n“Huh. Goodness Gracious”\n\nThe Boom-band blew beautifully that sunny afternoon\nThe day the machine stopped working was the day no one will forget it soon\nA terrible,dreadful cry pierced through the Long Street carnival\nAs the Ju-ju man emerged from his brand new house on the hill\nThe crowd took on a new alien voice\nAs the Boom-band’s physical vibe revealed his true form\nPeople screamed as the evil fiend morphed into some kind of park-town-prawn-like monster with and excruciatingly high-pitched screech like when you cook a lobster\n\nBut the boom-band just kept on playing\nAnd the creature rose up into the air and started spraying\nThis disgusting yellow smelly stuff as it flew back to its master\nWith his tail between his legs and everyone lived happily ever after\nThe End.\n\n[Assistant, Randomboy, Kidtronic]\n\n“Come on guys! How many times am I gonna have to tell you. No play-grounding in the yellow zone\"\n\n“Thank goodness and assistant!”\n\n“So it looks like I'm gonna have to... confiscate them, so uh.. do the right thing and hand them over.”\n\n“No, you cannot remove my friend’s playground from his face!”\n\n“Who's gonna stop me?”\n\n“Well obviously not me. I mean, just look how big you are. You must work out? Isn't that right Kidtronic?”\n\n“Oh Randomboy, I don't feel well”\n\n“You cannot remove my friends playground face. You see, there was a random chi surge a while ago while we were playing a game and it seriously messed up Kidtronics power wire. I mean, just look at him. If you remove it now, you might do some serious damage to my friends’ eyes and ears. That is why I too am wearing my playground. Not just to look cool. No, but to rather let Kidtronic hack into my head, and well, soothe my sense to stop the pain. Oh man, the, ooh- the unbearable pain. Isn't that right, Kidtronic?”\n\n“Ack- it's a seizure”\n\n“No man, just look we really have to go now. You see, it’s to go see uh..”\n\n“Snufflegr-“\n\n“Yes! Dr. Snufflegruff. So if yous- would you be so kind as to handcuff yourself to that tree, just look over there- Yes, please. Okay. Okay, thank you very much. We're going now.”\n\n[Narrator]\n\nAnd off they went…\n\n[Random Boy, Kidtronic]\n\nOh, phew. That was close. Good acting Kidtronic. Man- hey, yo, you can stop acting like that now, yo he's gone. Yo 'tronic, what the hell is going on? Do you hear me or something?”\n\n“Get away from me… Random Boy! Ow!”\n\n“Just Breathe”\n\n“Open the door. Just do it. Stop it!”\n\n“No, no, don't do that.”\n\n“There is something inside me. Help me. Random- random ripples in the mesh.”\n\n“Wha..Why?”\n\n“Come closer Snufflegruff. Random Boy, get back.\nStay Random Boy. My name is Kai.”\n\n“Kai, hmm.”\n\n“I have lay dormant in the mind of Kidtronic for 13 years. He is a mere vessel.”\n\n“Hmm.. oh”\n“And he has fulfilled his task beautifully, to seek out the ripple maker.\nTo find him, attach himself to me who weaves the random chaos pattern\nthat could undo all that Constructus had done. And this final threat, this natural abomination, this ripple in the mesh...is you Random Boy.”\n\n“Oh, far out.”\n\n“See? We are the same. We were destined to collide. My very purpose was to meet you. For you see, random boy, you are life, and I am death, and this, is our beautiful union!”\n\n“That sounds like a cool game. What's it called?”\n\n“Die Random Boy! Die!”\n\n“’Die. Random Boy. Die?’ Isn't that..?”\n\n[Laser and sound effects]\n\n[Narrator]\n\nAnd so Random Boy's shadow gets knocked the f-*bleep* out of him.\n\n[Watkin Tudor Jones]\nCool, that's cool. And put that *bleep* in.\nAnd we should even leave in the ra……………Embed"
    }
}