{
    "id": "ML1853",
    "mood": "sad",
    "artist": "Jean Grae",
    "title": "My Story",
    "song": {
        "_type": "song",
        "annotation_count": 25,
        "api_path": "/songs/5317",
        "artist_names": "Jean Grae",
        "full_title": "My Story by Jean Grae",
        "header_image_thumbnail_url": "https://images.genius.com/5d13119055de6c3d57049d3d376d4ff6.300x300x1.jpg",
        "header_image_url": "https://images.genius.com/5d13119055de6c3d57049d3d376d4ff6.780x780x1.jpg",
        "id": 5317,
        "instrumental": false,
        "language": "en",
        "lyrics_owner_id": 5280,
        "lyrics_state": "complete",
        "lyrics_updated_at": 1548161489,
        "path": "/Jean-grae-my-story-lyrics",
        "pyongs_count": 4,
        "relationships_index_url": "https://genius.com/Jean-grae-my-story-sample",
        "release_date_components": {
            "year": 2008,
            "month": 7,
            "day": null
        },
        "release_date_for_display": "July 2008",
        "release_date_with_abbreviated_month_for_display": "Jul. 2008",
        "song_art_image_thumbnail_url": "https://images.genius.com/5d13119055de6c3d57049d3d376d4ff6.300x300x1.jpg",
        "song_art_image_url": "https://images.genius.com/5d13119055de6c3d57049d3d376d4ff6.780x780x1.jpg",
        "stats": {
            "unreviewed_annotations": 1,
            "hot": false,
            "pageviews": 12735
        },
        "title": "My Story",
        "title_with_featured": "My Story",
        "updated_by_human_at": 1548161489,
        "url": "https://genius.com/Jean-grae-my-story-lyrics",
        "featured_artists": [],
        "primary_artist": {
            "_type": "artist",
            "api_path": "/artists/221",
            "header_image_url": "https://images.genius.com/e11e1dede036795edca0cee113786015.1000x1000x1.png",
            "id": 221,
            "image_url": "https://images.genius.com/e11e1dede036795edca0cee113786015.1000x1000x1.png",
            "index_character": "j",
            "is_meme_verified": false,
            "is_verified": true,
            "name": "Jean Grae",
            "slug": "Jean-grae",
            "url": "https://genius.com/artists/Jean-grae",
            "iq": 12896
        },
        "artist": "Jean Grae",
        "lyrics": "My Story Lyrics[Verse 1: Jean Grae]\n“If I could swim a thousand lakes to bring your life back...”  I write\nThat, but infinity can’t rewind facts.  You are\nDivinity.  My primitive mind was struggling\nJust to understand the meaning of life, forgive me\nI never told my mommy, I couldn’t break her spirit.  She always\nWished her daughter extraordinary thinking, so I\nTraveled alone, young, sixteen, got in\nThe habit of not staying at home, doing the\nSad walk like Bill Bixby, a dollar fifty\nTrips to the hospital so that Medicaid could fix me\nI couldn’t eat shit.  I fainted frequent\nOn cold floors and I pause and I think, “Keep it”\nI’m lost.  My four friends know and just\nFuck at the boys’ apartments for rent, so I’m all\nWishing that it’s a dream ending soon.  I’ve actually\nErased a lot that I’ve been through\n[Hook: Jean Grae]\nSee, when\nThe rain comes down\nI know it’s falling for me\nAnd only for me\nAnd when\nThe pain comes around, there’s nowhere\nElse I rather would be\nI know what I’ve done (Please forgive me)\n\n[Verse 2: Jean Grae]\nNow all my bitter homies saying, “That’s what men do.”  Feeling\nRetarded for seeing partner potential.  On top\nOf that, the doctors telling me a heart murmur.  I can’t\nTake it, I’m contemplating a Glock burner, a\nCop murderer.  I can’t leave.  This can’t be\nThe tears streaming, and I can’t see they lanced me\nAnd I’m passing out, and this is just for blood.  They had\nTo cover the mass amounts.  I’ve had enough\nAnd you don’t know what it’s like in waiting rooms, and out-\n-side, their picketing pictures could slay you\nThey’re screaming, “Victims,” and spitting ‘til they shame you\nI hold my head low and shiver, push my way through\nThey put you in a room where you can change into\nYour gown and shower cap, shaking as a fiend would do\nAnd that’s when you think of leaving, fleeing the building\nAnd then they call you and you’re hearing the call of your children\nThey count down from ten now.  You wanna stop ‘em, but\nYou say it in your head: you’re out for the cut\nAnd then you wake up in another room with plenty others\nThey call it recovery.  You’re thinking, “We ain’t mothers”\nAnd then prescription pills, written a ‘script with chills\nAn understatement.  You’re dressed but you’re naked still\nAnd your brain won’t think straight\nWait.  Can’t finish this\nYou might also like[Hook: Jean Grae]\nSee, when\nThe rain comes down\nI know it’s falling for me\nAnd only for me\nAnd when\nThe pain comes around, there’s nowhere\nElse I rather would be\nI know what I’ve done (Please forgive me)\n\n[Verse 3: Jean Grae]\nI kept it bottled up.  My parents found the pills\nScreaming, “God what have you done?”  Cried ‘til I snotted blood\nThen got a gun.  My temple ran quick though\nFrom the thought, then the worst: I was caught in the same place\nA year later.  For me, that’s when hatred started\nMy faith martyred.  I’ve dated the father of a father\nThen I moved on.  Years passed, the guilt’s\nWorse and it builds ‘til your heart’s smashed\nThen I miscarried.  Twenty-two age, I was headed to\nA breakdown, swallowed up some pills and I laid down\nI was a failure at that too, bailed from\nThe rap then, but fate took me back in\n“Sing” is a tattoo my fingers attached with.  Twenty-seven\nWith three kids that I never met.  What if I\nWas Catholic?  Wonder if they hate me, thinking how\nTheir mother could ever murder?  Well take me, Hell\nTo the depths where the brimstone chokes me constantly\nI am a monster, see.  How could I possibly\nCorrespond with God when I gave the authority\nTo end their life?\nBut it’s never over, even if we have a child\nThey could have had a brother or a sister or both\nI’m thinking about another life that almost got close\nPraying that, in another time, we could have changed posts\nIf I could just reverse time, I would\nI don’t know what I would do.  Honestly, it’s not good\nI’m sorry...4Embed"
    }
}