{
    "id": "ML1918",
    "mood": "angry",
    "artist": "High On Fire",
    "title": "The Face of Oblivion",
    "song": {
        "_type": "song",
        "annotation_count": 117,
        "api_path": "/songs/2724720",
        "artist_names": "Jordan Mechner (Ft. Patrice Désilets)",
        "full_title": "Prince of Persia: The Sands of Time by Jordan Mechner (Ft. Patrice Désilets)",
        "header_image_thumbnail_url": "https://images.genius.com/5441331c5c00ce361ea591fc20a06506.300x75x1.gif",
        "header_image_url": "https://images.genius.com/5441331c5c00ce361ea591fc20a06506.1000x249x1.gif",
        "id": 2724720,
        "instrumental": false,
        "language": "en",
        "lyrics_owner_id": 322655,
        "lyrics_state": "complete",
        "lyrics_updated_at": 1585987957,
        "path": "/Jordan-mechner-prince-of-persia-the-sands-of-time-annotated",
        "pyongs_count": 6,
        "relationships_index_url": "https://genius.com/Jordan-mechner-prince-of-persia-the-sands-of-time-sample",
        "release_date_components": {
            "year": 2003,
            "month": 11,
            "day": 6
        },
        "release_date_for_display": "November 6, 2003",
        "release_date_with_abbreviated_month_for_display": "Nov. 6, 2003",
        "song_art_image_thumbnail_url": "https://images.genius.com/87c44c0ed9062a2ebe8626586307d959.300x300x1.jpg",
        "song_art_image_url": "https://images.genius.com/87c44c0ed9062a2ebe8626586307d959.500x500x1.jpg",
        "stats": {
            "unreviewed_annotations": 0,
            "hot": false
        },
        "title": "Prince of Persia: The Sands of Time",
        "title_with_featured": "Prince of Persia: The Sands of Time (Ft. Patrice Désilets)",
        "updated_by_human_at": 1585987956,
        "url": "https://genius.com/Jordan-mechner-prince-of-persia-the-sands-of-time-annotated",
        "featured_artists": [
            {
                "_type": "artist",
                "api_path": "/artists/889377",
                "header_image_url": "https://assets.genius.com/images/default_avatar_300.png?1679675825",
                "id": 889377,
                "image_url": "https://assets.genius.com/images/default_avatar_300.png?1679675825",
                "index_character": "p",
                "is_meme_verified": false,
                "is_verified": false,
                "name": "Patrice Désilets",
                "slug": "Patrice-desilets",
                "url": "https://genius.com/artists/Patrice-desilets"
            }
        ],
        "primary_artist": {
            "_type": "artist",
            "api_path": "/artists/889375",
            "header_image_url": "https://images.genius.com/2f91289df8e3d1285dd885f71460814c.1000x563x1.jpg",
            "id": 889375,
            "image_url": "https://images.genius.com/379e839b6c7556283cc9bcb83c03bd80.630x420x1.jpg",
            "index_character": "j",
            "is_meme_verified": false,
            "is_verified": false,
            "name": "Jordan Mechner",
            "slug": "Jordan-mechner",
            "url": "https://genius.com/artists/Jordan-mechner"
        },
        "artist": "Jordan Mechner",
        "lyrics": "Prince of Persia: The Sands of Time LyricsINT. FARAH'S BEDROOM – NIGHT\nFARAH, a beautiful Indian Princess, lies asleep in bed. Translucent curtains billow in the breeze.\nPRINCE (V.O.)\nMost people think time is like a river that flows swift and sure in one direction. But I have seen the face of Time, and I can tell you... they are wrong.\nFarah awakens suddenly with a gasp.\n\nPRINCE (V.O.)\nTime is an ocean in a storm.\nEXT. JUNGLE – NIGHT\n\nThe PRINCE runs through a dense jungle, pushing aside leaves and branches. Grim determination on his face, as if he is on his way to save the world. In fact, he is.\n\nAs he runs, we hear his VOICE OVER:\n\nPRINCE (V.O.)\nYou may wonder who I am and why I say this. Sit down, and I will tell you a tale like none that you have ever heard.\n\nTHE JUNGLE SKY\n\nA FLAMING ARROW arcs high into the air.\n\nEXT. INDIAN PALACE --- DAWN\n\nKING SHAHRAMAN, 70, watches from an atoll on horseback. Beside him is the Prince. Below, an Indian Palace is under attack by Persian soldiers.\n\nPRINCE (V.O.)\nKnow, first, that I am the son of Shahraman, a mighty king of Persia. On our way to Azad with a small company of men, we passed through India...\n\nSwords and horsemen clash in the driving rain, Persian soldiers against Indian soldiers. Catapults hurl flaming projectiles. Part of the palace is on fire.\n\nEXT. INSIDE PALACE GATES --- DAWN\n\nA richly dressed Indian VIZIER, an obvious villain, sneaks up on the Indian Soldier guarding the main gate.\nPRINCE (V.O.)\nWhere the promise of honor and glory tempted my father into a grievous error.\nThe Vizier draws a dagger, kills the startled soldier, and pulls the rope to open the gate.\n\nEXT. INDIAN PALACE --- DAWN\n\nThe gate goes up. With a cry of triumph, the Persian soldiers swarm toward the open gate.\n\nSHAHRAMAN\nNow, my son!\n\nShahraman’s old eyes gleam with the lifelong love of war. Letting out a battle cry, he gallops down the hill. The young Prince gallops eagerly after him.\n\nEXT. INSIDE PALACE GATES --- DAWN\n\nPersian soldiers storm through the courtyard, overwhelming the surprised Indian soldiers.\n\nShahraman and the Prince gallop to a stop before the Vizier, who welcomes them. Fighting continues around them. (Note: The Vizier carries a STAFF with an unusual ornament.)\nVIZIER\n(obsequious)\nYour Majesty, the Maharajah's treasure vaults lie within.\n\nHe points. The Prince's eyes follow his pointing finger to a burning wing of the palace.\nVIZIER\nI trust you will remember your promise...?\n\nThat's all the Prince needs to hear. He spurs his horse and gallops off in the direction indicated by the Vizier.\n\nSHAHRAMAN\n(chuckles proudly)\nSee how he rides! Like a warrior’s son.\n\nEXT. PALACE COURTYARD --- DAWN\n\nThe Prince, on horseback, charges through the palace gates. Fires burn around him. Soldiers fight hand-to-hand, on horseback and on foot.\n\nEnthralled by the sights of battle at close range, the Prince fails to notice the burning column behind him start to topple.\n\nHis horse jumps out of the way, just in time to avoid being crushed by the falling column. The Prince is thrown. Jumps to his feet, too late to catch his fleeing horse.\nHe is on foot, in the midst of battle. He reaches for his dagger --- realizes he's lost it: his thigh holster is empty.\nGame Play : Indian Palace\nA setting of great drama and chaos, with parts of the palace burning and collapsing, and hand-to-hand combat raging between Indian and Persian soldiers.\nA cannonball blasts a hole in the palace wall. Entering, the Prince finds himself in the Maharajah’s treasure vault. The sounds of battle recede; the Prince is alone. In the center of the room is a giant HOURGLASS that seems to radiate a mysterious power.\nBypassing the hourglass, the Prince scales a giant elephant statue to reach the DAGGER OF TIME.\n\nINT. TREASURE VAULT – MORNING\n\nA sensuous close-up view of the DAGGER OF TIME. The jewels in the hilt gleam. Its blade is translucent.\n\nThe Prince approaches the dagger, takes it. Turns it in his hand; he is curious to notice that it contains sand.\n\nPRINCE\nSand...\n\nVIEW FROM ABOVE\n\nHigh above the Prince, a massive stone gargoyle teeters...and starts to fall.\n\nTHE PRINCE\n\nUnaware of the stone gargoyle plunging toward him, he notices a switch on the dagger's hilt. He presses it. SAND spills from the dagger onto the floor.\n\nAt the last second, the Prince looks up to see the gargoyle about to crush him. His eyes widen with the terror of certain death. But just then ---\n\nREWIND!\n\nThe gargoyle springs back up, reversing its trajectory, and lands in its original position.\n\nTHE PRINCE\n\nblinks, baffled as to what just happened.\n\nAs he is staring up at the gargoyle, it teeters, just as it did before, and starts to fall a second time.\n\nThis time, forewarned, the Prince jumps back out of the way. The gargoyle crashes harmlessly next to him.\n\nHe looks at the dagger. He still doesn't understand what happened --- but he's going to keep it. He sheathes the dagger in his empty thigh holster.\n\nJust then, the walls start to shake around him. The treasure vault is about to collapse.\n\nGame Play : Indian Palace, continued\nThe Prince runs for his life as the palace collapses around him, finally landing back in the Hourglass Room.\n\nINT. HOURGLASS ROOM --- MORNING\n\nThe Prince dives and lands on the floor, covering his head with his arms to protect himself from falling debris.\n\nWhen no more debris falls, he dares to lift his head... and finds himself confronted by a pair of royal boots, inches from his nose.\n\nLooking up, he sees King Shahraman glaring down at him in disapproval. A most undignified position for a Prince.\n\nThe Prince saves the moment by quickly rolling to his feet, and proudly displaying the dagger.\nPRINCE\nFather, I have brought us honor and glory!\n\nThe Vizier is seized by a tubercular coughing fit that makes both Shahraman and the Prince look at him.\n\nVIZIER\n(when he recovers)\nYour Majesty... You promised me my choice of the Maharajah's treasures.\n(pointing)\nThat dagger...\n\nThe Prince protects the dagger possessively. Shahraman looks indulgent; he has a soft spot for his youngest son.\n\nSHAHRAMAN\nSurely you won’t deny the lad a souvenir of his first battle? You may have your choice of all the Maharajah's other treasures.\n(an afterthought)\nExcept that hourglass.\n\nWHIP PAN TO THE HOURGLASS, now being lifted with ropes by six Persian soldiers.\n\nSHAHRAMAN (O.S.)\n...That will make a fine gift for the Sultan of Azad, when we pass through his city.\n\nThe Vizier’s expression transforms into a look of hate.\nSHAHRAMAN\n(continuing, oblivious)\nAnd some exotic animals for his menagerie... and a few dozen slave girls... Yes, that should be enough. I shall choose them myself.\nBEHIND A COLUMN\n\nWhile Shahraman’s speech continues, Farah, the beautiful young Indian girl from the first scene, peers around the column. Her large dark eyes widen with outrage.\nSHAHRAMAN (O.S.)\n(raising his voice)\nI want no animals or maidens harmed  until I have chosen! Let it be known King Shahraman is merciful in victory!\nA shadow passes over Farah. She whirls with a gasp to see TWO PERSIAN SOLDIERS standing menacingly behind her. On her terror-stricken face ---\n\nCUT TO:\n\nEXT. PERSIAN DESERT --- DAY\n\nA magnificent royal procession of hundreds of men, horses and animals, crosses the white sands.\n\nPRINCE (V.O.)\n‘Trust not a man who has betrayed his master, nor take him into your own service... lest he betray you too.’\n\nIllustrate this by panning from a caged tiger to the Indian Vizier riding alongside.\n\nPRINCE (V.O.)\nI learned the truth of this, to my sorrow, the day that we arrived in Azad as the Sultan's honored guests.\nThe next carriage contains veiled SLAVE GIRLS. Peering out through the slatted window is Farah, her eyes burning with determination. Though she has been captured as a slave girl, we sense she is not resigned to her fate.\n\nCAMERA lingers on Farah a moment... then RISES to reveal the caravan’s destination: the splendid PALACE OF AZAD.\n\nINT. RECEPTION HALL --- NIGHT\n\nA splendid royal hall, lined with Persian men and women. Guards stand at attention. The roly-poly SULTAN OF AZAD steps down from his throne to greet King Shahraman (Prince and Vizier behind him).\n\nSHAHRAMAN AND SULTAN\n(simultaneously)\nMy friend!\n\nThey embrace.\n\nSULTAN\nYour visit brings joy and honor to my poor and humble dwelling. If only you had given me time to prepare a proper welcome!\n\nSHAHRAMAN\n(not to be outdone)\nThe glories of Azad are famed throughout the world. One cannot improve on perfection. And yet, I hope that in your palace there may still be room for a few paltry gifts from India.\n\nShahraman gestures. TWO DOZEN SLAVE GIRLS step forward in unison and bow to the Sultan with a flourish.\n\nAs CAMERA RACES down the row of slave girls, one of them surreptitiously lifts her eyes: Farah.\n\nShahraman gestures again. The Sultan’s eyes glitter with childlike anticipation as he turns to see...\n\nROARR!!! The Sultan jumps as a BENGAL TIGER strains his leash held by two Persian Guards. Two more tigers behind. The Sultan shivers pleasurably.\n\nSULTAN\nMagnificent specimens. And so many gifts! I am quite speechless!\n\nSHAHRAMAN\nAh, the best is yet to come! I give you... The Sands of Time!\n\nHe turns, gestures with a flourish to the Hourglass. The velvet cloth covering it flies up, lifted to the ceiling by a rope.\n\nSHAHRAMAN\nMay the friendship between our kingdoms endure as long as Time itself!\n\nThe Sultan approaches the Hourglass, studies it with fascination. The Slave Girls retreat to the far end of the hall.\n\nSULTAN\nThe Sand... Why does it glow?\n\nSHAHRAMAN\n(he has no idea)\nEr, um...\n\nVIZIER (O.S.)\nI can tell you.\n\nShahraman and the Sultan turn in surprise; it is the Indian Vizier who has spoken. He takes this opportunity to step forward, with a dry cough.\n\nVIZIER\nInside the hourglass is a marvel that no living man has seen.\n\nThe Sultan's eyes light up --- only to be disappointed when the Vizier adds:\n\nVIZIER\nAlas, I cannot open it. Only the Dagger can unlock the Sands of Time... and it belongs to a greater one than I.\n\nHe points suddenly to the Prince --- who is discomfited to find himself the center of attention.\n\nVIZIER\nA young Prince dearer to his father than all the wealth of India. Perhaps he will oblige...?\n\nFarah’s eyes widen with horror as she sees ---\n\nHER POV: FAST TRACK-IN, THE LENGTH OF THE HALL, TO CLOSE-UP OF THE DAGGER on the Prince's thigh.\n\nFARAH\nNo!\n\nTHE PRINCE,\n\nhappy to oblige, draws the dagger.\n\nFARAH\n\nrushes toward him. But there's a lot of distance to cover.\n\nFARAH\nNo! Stop!\n\nTHE PRINCE\n\nToo far away to notice Farah, he steps to the hourglass, thrusts the dagger into the slot provided for that purpose, and twists it --- instantly triggering TIME-BLUR SLOW-MOTION EFFECT.\n\nFARAH\n\nrunning toward him, in slow motion...\n\nFARAH\nNOOOOO!!!!\n\nTHE PRINCE\n\nbecomes aware of Farah's distorted cry. In slow motion, he turns, sees her running toward him...\n\nAs suddenly as it started, END TIME-BLUR SLOW-MOTION EFFECT.\n\nSand pours out of the hourglass onto the floor. The sand is bright white, almost glowing.\n\nFarah stops running. It's too late.\n\nShahraman, the Sultan and Vizier stare at the flowing sand. The Vizier's eyes gleam with joyful expectation.\n\nThe room begins to shake.\n\nWorried eyes rise to the vaulted ceiling as the shaking increases. Dust and bits of stone rain down.\n\nThe Sands of Time creep along the floor, slowly, like a dryice fog. The Prince looks down uneasily as the sand swirls around his feet, Shahraman's and the Vizier's.\n\nThe sand cloud rises around the Vizier. He takes a step back, raising his staff, and speaks imperious words of command in a foreign tongue:\n\nVIZIER\n(in Sanskrit)\n‘Sands of Time, Back!’\n\nThe ornament on the Vizier’s staff FLASHES, repelling the sand cloud. Others in the room are not so lucky.\n\nThe Sultan shrinks uncomfortably from the sand cloud rising around him. Looks to Shahraman for reassurance.\n\nSULTAN\nIs it meant to do this?\n\nKING SHAHRAMAN\n\nsees the Sands creeping up his legs. He tries to push it away, then draws his sword, trying to fight it. The sand  sucks the water from his body, transforming him into a hideous SANDMAN. A WOMAN SCREAMS.\n\nPRINCE\nFATHER!!!\n\nIn quick succession, the Sultan and his two nearest BODYGUARDS are likewise transformed into Sandmen.\n\nSCREAMING MEN AND WOMEN\n\nrun from the pursuing sands, as chunks of stone rain down from the ceiling. Farah among them.\n\nTHE PRINCE\n\nlooks down in confusion at himself. Why has he been spared? His Dagger is glowing, repelling the sand cloud, just as the Vizier’s ornament did.\n\nTHE VIZIER\n\nsteps toward the Prince. Stretches out his hand.\n\nVIZIER\nGive me the dagger!\n\nPRINCE\n(fearful)\nNo!!\n\nVIZIER\nYou have unleashed the Sands of Time. I can undo what you have done. Give it to me!\n\nThe Prince backs away in horror, shaking his head...\nGame Play : Royal Chambers\nAs the Prince tries to escape, he is repeatedly attacked by hosts of Sandmen—the palace’s inhabitants, transformed by Sands of Time into hideous monsters. The Dagger proves essential to his survival, since it is the only weapon that can vanquish them.\n\nINT. PASSAGEWAY --- NIGHT\n\nFarah grabs the Prince by the hand and yanks him into the passageway; the door slams shut behind them, sealing out a snarling Sandman.\nFarah faces the startled Prince. She puts her hand out.\n\nFARAH\nGive me the Dagger.\n\nThe Prince stares at her for a moment. Sands of Time are swirling in the air around both of them; so why is she spared? Her MEDALLION is glowing, repelling the sand cloud. Like his dagger. Like the Vizier’s staff.\n\nThe Prince pushes Farah against the wall. His eyes are wild and traumatized.\n\nPRINCE\nWho are you?\n\nFARAH\nI am Farah, the daughter of the Maharajah from whom you stole it. This is your doing.\n\nPRINCE\n(beserk)\nI saw my father turned to sand!\n\nFARAH\nAnd we will share his fate, if you do not give me the Dagger, to undo what you have done!\n\nPRINCE\nYour traitorous Vizier used the same words.\n(He pushes away from Farah)\nFrom now on, I trust no one but myself.\nWith a terrifying ROAR, TWO SANDMEN land nearby. Farah shrinks back in fear, as the Prince draws his sword.\n\nPRINCE\nRun!\n\nFarah doesn’t need to be told twice. She scrambles through a crack in the wall. The Prince tries to follow, but is too big to fit. Giving up, he turns to face the Sandmen.\n\nFarah’s frightened eyes peer at him from the other side of the crack.\n\nPRINCE\nGo back to the reception hall; wait for me there. GO!!!\n\nAnd blocks a mighty blow as the Sandmen attack him.\nGame Play : Royal Chambers\nEn route to the reception hall, the Prince helps a guard activate the palace’s military defense system.\n\nINT. CONTROL ROOM – NIGHT\n\nAs the Prince throws his lever, the Guard simultaneously throws his. The DEFENSE MECHANISM rumbles to life.\n\nSERIES OF QUICK CUTS showing traps activating in different locations throughout the palace:\n\nQUICK CUT --- A PORTCULLIS\n\nslams shut.\n\nQUICK CUT --- SPIKES\n\nspring out of the floor, skewering a Sandman, who explodes into a cloud of sand.\n\nQUICK CUT --- ANOTHER PORTCULLIS\n\nslams shut.\n\nQUICK CUT --- BLADES\n\nwhip out of the wall, then retract, passing so close to the camera that it shakes.\n\nINT. CONTROL ROOM --- NIGHT\n\nThe defense mechanism finishes its work, and comes to a stop. The Prince and Guard stand watching it.\nGame Play : Royal Chambers\nThe Prince soon regrets having activated the defense system, as it makes his progress through the palace much more dangerous.\n\nINT. RECEPTION HALL --- NIGHT\n\nThe Prince appears on a balcony overlooking the Reception Hall. He sees Farah surrounded by an army of menacing SAND PEOPLE.\n\nPRINCE\nFarah!!\n\nShe looks up at him... then returns her attention to the desperate fight. Reloading her bow, she shoots arrow after arrow.\n\nOne SAND GUARD takes an arrow in the chest... and keeps on coming.\n\nTHE PRINCE\n\njumps off the balcony, does a spectacular walling and rebound to land between Farah and the Sand People. He draws his sword and dagger.\n\nPRINCE\nFarah, get back!\n\nGame Play : Reception Hall\nThe Prince fights the sand creatures, with Farah’s help, until only four are left.\n\nINT. RECEPTION ROOM --- NIGHT\n\nThe Prince turns to face the new enemies.\n\nTHE FOUR ENEMIES\n\nstep forward. Three of them wear the uniforms of King Shahraman's personal bodyguards. The fourth wears the uniform of Shahraman himself.\n\nHe is THE SAND KING.\n\nFARAH AND THE PRINCE\n\ngasp in horror.\n\nPRINCE\nFATHER!!\n\nTHE SAND KING\n\nGROWLS... a hideous, inhuman sound. Though he resembles King Shahraman, he shows absolutely no recognition of his son. His face is as cold and dead as that of any sand creature. He steps forward to fight the Prince.\n\nGame Play : Reception Hall\nThe Prince fights and kills the Sand King.\n\nINT. RECEPTION HALL --- NIGHT\n\nThe Prince and the Sand King SCREAM together in rage and pain as sand flows from the Sand King into the Prince`s dagger. And then it’s over.\n\nWIDE SHOT – HIGH ANGLE\n\nThe great hall, empty of enemies. The Prince falls to his knees and stays there.\n\nFarah, at a distance, approaches him timidly. (A Sand Vortex is forming about 15 meters away, unnoticed by either of them.)\n\nTHE PRINCE\n\nOn his knees, grieving.\n\nFarah comes up behind him. Hesitant, awkward.\n\nFARAH\nI'm sorry.\n\nAt first it seems the Prince has not heard her. Then, he speaks without turning. His voice is expressionless.\n\nPRINCE\nWhy?\n\nFARAH\n(somewhat taken aback by his coldness)\nI know what it is to lose a father.\n\nNow the Prince turns. His eyes are like ice.\n\nPRINCE\nThat was not my father.\n\nHe stands. Sheathes his sword and dagger.\n\nHe turns. Sees the VORTEX that has formed behind them.\n\nHis eyes narrow in determination. He strides toward the vortex. Farah is terrified. To her it looks like he’s about to commit suicide.\n\nFARAH\nWhat are you doing?... Wait!\nSTOP!!\n\nIgnoring her, the Prince PLUNGES into the Vortex. He lets out a cry of pleasure and pain as huge quantities of sand flow into his dagger from all sides.\n\nWHAM!! The Prince finds himself levitated a meter off the floor, in fetal position. Farah stares in astonishment.\n\nEXT. PALACE --- DAY (VISION EFFECT)\n\nEstablishing shot of the palace. Camera zeroes in on the TOWER OF DAWN, flies toward it at increasing speed, and into a window...\n\nINT. TREASURE VAULT --- DAY (VISION EFFECT)\n\nThe SAND GRIFFIN’s great wings flap slowly as it lowers the Hourglass into the center of the room. The Vizier stands nearby, supervising this operation.\n\nEXT. TOWER OF DAWN --- DAY (VISION EFFECT)\n\nThe Sand Griffin flies out the window and glides down in spirals toward earth.\n\nEND VISION.\n\nINT. RECEPTION HALL --- NIGHT\n\nThe Prince, curled up in fetal position on the cold marble floor, awakens. A shadow passes over him. He looks up...\n\nAnd snatches the Dagger from the floor where it fell, moments before Farah is able to grab it. The Prince rolls to his feet. Farah is caught red-handed.\n\nPRINCE\nSo! This is the thanks I get for saving your life!\n\nFARAH\nYou don't understand! I need that Dagger, to undo ---\n\nPRINCE\n‘To undo what I have done.’ Truly, you must think I am a fool!\n\nFARAH\nYou are right to be cautious. But fight as bravely as you may, you cannot defeat this enemy. The Sands will spread. They will consume... everything.\nShe lays her hand on his arm. Her big, dark eyes look straight into his. The Prince weakens.\n\nFARAH\nI have heard it said that you are kind as well as brave. Please believe me. Help me find the Hourglass.\n\nPRINCE\n(reluctantly)\nIt is in the Sultan's treasure vault atop the Tower of Dawn.\n\nFARAH\nHow do you know that?\n\nPRINCE\nI just know. Come with me, then, if you insist. But I warn you, I move pretty fast. You’d better keep up.\n\nFarah is already running off. She climbs out the broken window and drops from sight.\n\nEXT. PALACE --- NIGHT\n\nFarah runs and jumps along the rocks, quick and agile.\n\nBehind Farah, the Prince emerges from the hole in the palace wall. Farah turns, beckons for the Prince to follow.\n\nFARAH\nCome on!\nGame Play : Zoo / Barracks\nTogether, the Prince and Farah make their way through the moonlit ruins of the Sultan’s fabled zoo. In the darkness prowl Sand Tigers and other frightening beasts, whom the Prince must fight.\nEscaping from the zoo, they pass through the military barracks, and emerge onto a bridge.\nEXT. BRIDGE --- NIGHT\n\nA concrete bridge extends between two towers, a garden far below. Farah and the Prince appear at one end.\n\nPRINCE\nThis way!\n\nCAMERA does a 180°, showing a portcullis open at the other end of the bridge. The Prince runs INTO SHOT, across the bridge, Farah right behind him.\n\nFARAH\n\nA shadow passes over her. She stops. Looks up ---\n\nFARAH\n(screaming)\nLook out!!\n\nWarned, the Prince turns; dives out of the way just in time to avoid being clipped by the Sand Griffin’s wing. The blow SHATTERS the bridge between them, creating an 8m gap. Farah scrambles to safety on her side of the gap. The Prince rolls to his feet and draws his sword, as the Sand Griffin circles and flies back toward him...\nGame Play : Broken Bridge\nThe Prince fights off the Sand Griffin, and is again rewarded with a vision.\nINT. CISTERNS --- NIGHT (VISION EFFECT)\n\nDESCENDING into a water chute...\n\nMOVING through cavern passageways...\n\nDRIFTING across the surface of a vast water tank...\n\nSAND EUNUCHS AND COURTESANS, a terrifying vision, turn in unison to face us...\n\nEXT. BROKEN BRIDGE --- NIGHT\n\nFarah comes into focus on the other side of the bridge. Her voice seems to come from a great distance.\n\nFARAH\nWake up! Please wake up!\n\nThe Prince, lying on the ground, stirs. Gets up.\n\nFARAH\n(gasps)\nYour arm!\n\nThe Prince looks at his left arm --- it's bare and bleeding, the sleeve partially torn off by the Sand Griffin's claws. He tears off the sleeve and tosses it away. He extends one arm to Farah.\n\nPRINCE\nFarah, jump!\n\nTheir eyes meet. Farah trusts him. She jumps.\n\nAt the last moment, the Prince catches her by the arm. Farah hangs struggling in space...\n\nWIDE SHOT\n\nshowing the two small figures hanging precariously from the broken bridge. Vertigo!\n\nFARAH AND PRINCE\n\nThe Prince pulls Farah up to safety.\n\nAs he does, their faces are brought close together. For a moment it seems the Prince might kiss her... or say something nice...\nA MECHANICAL NOISE behind them. The Prince turns to see the portcullis starting to close.\n\nGame Play : Broken Bridge\nThe Prince and Farah sprint along the bridge toward the closing gate.\n\nEXT. BROKEN BRIDGE --- NIGHT\n\nFarah reaches the slowly descending portcullis first; ducks under it. Turning, she shouts to the Prince, who is still running:\n\nFARAH\nI'll raise the gate for you!\n\nShe steps to the wall; grabs a lever ---\n\nThe Prince guesses what's about to happen. Sprinting toward the gate, he shouts ---\n\nPRINCE\nNO!!\n\nToo late. Farah throws the lever. Instantly, the gate SLAMS SHUT in the Prince's face just as he reaches it.\n\nFarah throws the lever again. It does nothing. The Prince glares at her through the bars.\n\nPRINCE\nYou go on down. I’ll find another way in.\n\nFarah gives him a look of humiliation... then turns and runs off into the tower, until she has disappeared from sight.\nGame Play : Ext. Tower / Int. Baths\nWith some difficulty, the Prince rejoins Farah in the royal baths just in time to save her from a bevy of Sand Eunuchs and Sand Courtesans.\n\nINT. HAREM --- MORNING\n\nA BLUR gradually comes into focus, becomes Farah (dripping wet) stroking the Prince's hair. He is lying on the tiled floor with his head in her lap.\n\nFARAH\n(desolate)\nDon’t leave me... My love... Please don’t leave me.\n\nThe Prince’s eyes flicker open.\n\nPRINCE\nWhat did you call me?\n\nEmbarassed at having revealed her feelings, Farah briskly jumps to her feet, allowing the Prince’s head to bang against the tiled floor.\n\nFARAH\nIt doesn’t matter. The important thing is, I know how we can reach the Tower of Dawn.\n\nPRINCE\n(wincing, rubs his head)\nOf course. The hourglass.\n\nFARAH\nYou said it was in the Sultan’s treasure vault atop the tower. I hope you’re right. It takes two to lower the bridge. One at the top of each watchtower.\n\nPRINCE\nHow do you know?\n\nFarah’s big brown eyes gaze innocently into his.\n\nFARAH\n‘I just know.’\n\nThe Prince is uncertain whether she is making fun of him.\n\nPRINCE\nAll right. But this time, stay with me, and pay attention. I can't spend all day chasing after you.\n\nFarah looks like she wants to make an angry retort. But the Prince is already moving on.\nGame Play : Hall of Learning / Barracks\nFarah and the Prince solve the mirror puzzle of the Hall of Learning, and escape onto the ramparts that connect the two watchtowers. The Prince sees Farah safely into her watchtower. He himself is not so lucky.\n\nEXT. RAMPARTS --- DAY\n\nAs the Prince runs, the stone floor starts to crumble beneath his feet.\n\nHe turns, runs back. Too late. Falling, he tries to grab the crumbling ledge. It breaks away.\n\nHe plunges into the darkness of a stone shaft. A rain of rocks accompanies him. Falling past a ledge, he tries to grab it; his fingers slide off.\n\nINT. DUNGEON --- DAY\n\nWHAM! The Prince hits the stone floor. As he is getting up, a ROCK falls on his back, knocking him flat.\n\nFADE TO BLACK.\n\nFADE IN:\n\nThe Prince opens his eyes. He is in a dungeon, amid debris. Daylight streams in through a small barred window. And through the hole in the ceiling, high above.\n\nPainfully, the Prince sits up. Rubs his head. He winces as he rises to his feet.\n\nGrimly, he strips off his other torn sleeve; tosses it aside.\nGame Play : Prison / Forge / Barracks\nThe Prince escapes from the dungeon, and uses a catapult to smash his way into the watchtower. As he throws his lever, Farah, in the other watchtower, throws hers… lowering the bridge to the Tower of Dawn.\n\nEXT. TOWER OF DAWN --- DAY\n\nAs Farah and the Prince run across the bridge...\n\nWHAM!!! The bridge shakes as the Sand Griffin lands, barring their way.\n\nFarah backs away, drawing her bow. The Prince draws his sword to fight. The Sand Griffin bats him with a powerful wing, sending him flying back into the courtyard.\n\nEXT. COURTYARD --- DAY\nThe Prince lands, stunned. WHAM! The Sand Griffin lands in front of him.\n\nThe Prince gets warily to his feet. It’s going to be a fight, and one he really isn’t looking forward to.\n\nFARAH\nBe careful!\nGame Play : Tower of Dawn Courtyard\nThe Prince defeats the Sand Griffin and is again rewarded with a vision.\n\nEXT. TOWER OF DAWN --- DAY\n\nThe Prince trembles as huge quantities of sand flow into the dagger from all sides. The dagger glows with a bright light.\n\nINT. TOMB --- NIGHT (VISION EFFECT)\n\nFarah looms into view, cold determination in her eyes. She reaches toward CAMERA...\n\nTHE DAGGER\n\nlies beside a heap of the Prince's clothes, sword and sandals. Farah reaches for it...\n\nEXT. TOWER OF DAWN --- DAY\n\nThe Prince awakens to find his head in Farah's lap; she is tenderly stroking his hair. In a flash he draws his dagger, scrambling to his feet. He faces her like an enemy. His eyes are wild with paranoia.\n\nFARAH\nIt's all right! It's me!\n\nConfused, the Prince looks at the dagger in his hand. If she wanted to take it, she could have.\n\nFARAH\n(with infinite tenderness)\nIt's me!\n\nThe Prince hesitates... then pockets the dagger. Farah takes his hand, guides him toward the open gate of the next room.\n\nFARAH\nLook! At last we’re here! The Tower of Dawn!\nEagerly, she runs past him toward the open door. The Prince looks after her suspiciously. His visions have never lied to him before...\nGame Play : Tower of Dawn\nThe Prince and Farah reach the treasure vault at the top of the Tower of Dawn, where the Vizier has brought the Hourglass.\n\nINT. HOURGLASS VAULT --- DAY\n\nThe Prince lands on top of the hourglass. Farah, excited, calls to him from below.\n\nFARAH\nYou did it! Do you see the dome atop the hourglass?\n\nThe Prince looks. Sees the bubble of a glass dome just as she described it.\n\nFARAH\nTake the dagger. Strike it into the center of the dome!\n\nThe Prince draws his dagger, ready to obey. He looks at Farah ---\n\nQUICK CUT --- VISION FLASHBACK\n\nFarah looms into view, cold determination in her eyes, reaching toward camera...\n\nBACK TO SCENE\n\nThe Prince looks at the dagger in his hand. Looks down at Farah; she is standing below, looking up at him.\n\nPRINCE\n(suspiciously)\nWhy does the Vizier want the dagger?\n\nFARAH\nWhat? Go on --- do it!\n\nThe Prince hesitates. He lowers the dagger.\n\nPRINCE\nYou have every reason to hate me.\n\nFARAH\nWhat are you talking about?\n\nPRINCE\nMy father's army sacked your palace... captured you as a slave. Now you want me to trust you.\n\nFARAH\n(desperately)\nPlease. There’s no time!\n\nThe Prince turns. Farah turns. CAMERA WHIPS following their gaze to ---\n\nTHE VIZIER\n\nstands in the entrance to the Hourglass Room. His eyes blaze. He raises his staff, a terrifying sorcerer.\n\nVIZIER\n(in Sanskrit)\n‘Winds of the desert, blow! Blow!\nBlow!!’\n\nEven as he speaks, WIND stirs the room...\n\nTHE PRINCE\n\natop the hourglass, is suddenly BLOWN across the room. Hits the wall, sprawls on the floor under a window. He's missed his chance.\n\nFARAH\n(anguished scream)\nNOOOO!!!!\n\nTHE VIZIER\n\nHis staff ornament GLOWS, a nimbus of wizardly light protecting him from the howling winds and blowing SAND. He advances on the Prince. Stretches out his hand.\n\nVIZIER\nGive me the dagger!\n\nFARAH\n\ngrabs hold of a pillar, clings to it desperately. But the wind is too strong; it breaks her grip. With a cry, she sails across the room.\n\nThe Prince lunges, grabs her hand just in time to save her from being blown out the window. With his other hand, he grasps a pillar.\n\nFARAH\n(desperately)\nThe dagger! He must not get the dagger!\n\nThe Vizier advances determinedly. As he reaches out for his prize, the Prince suddenly lets go of the pillar. The surprised Vizier's hand closes on empty air, as the Prince and Farah fly out the window.\nGame Play : Sandstorm\nBlown across the parapets by the howling sandstorm, the Prince and Farah manage to find shelter.\n\nINT. TOMB --- DAY (SANDSTORM)\n\nThe door SHUTS behind the Prince and Farah, sealing out the howling winds. TORCHES flame on, illuminating a mausoleum.\n\nThe Prince’s gaze flies to the stone slab in the center of the room. His eyes widen in supersti[ti]ous fear.\n\nPRINCE\nA tomb!\nFarah whirls to face the Prince in bewildered anger. All is lost now --- and it’s his fault.\n\nFARAH\nYou were there! The dagger was in your hand! Why did you hesitate?\n\nThe Prince has no reply. He knows he screwed up.\n\nFARAH\nYou think you’re cleverer than everybody. But you’re just like the rest of them... those soldiers... All they can do is fight, destroy. Why did I trust you?!?\n\nThe Prince slumps down onto the tomb, head in hands. His despair is obvious.\n\nFarah sees his distress. Her eyes fill. She sits beside him, places her hand tenderly on his shoulder.\n\nFARAH\n(forlorn, plaintive – she loves him)\nWhy didn’t you trust me?\nThe Prince looks up at her.\n\nFarah looks back at him as if she wants to be kissed. She has never been more beautiful.\n\nAs if in a dream, the Prince leans toward her...\n\nTHE TORCHES GO OUT. TOTAL BLACKNESS. Scuffling sounds.\n\nFARAH\nOw!\n\nPRINCE\nSorry.\n\nMore scuffling sounds.\n\nFARAH\n(in sudden fear)\nWhere are you?!\n\nPRINCE\nI’m right here.\n\nFARAH\nHold my hand. Don’t let go.\n\nSilence. Nestling sounds. Breathing.\n\nFARAH\nI didn’t mean what I said.\n\nPRINCE\n(miserably)\nNo, you’re right. All that’s happened is my doing. I wanted honor and glory... I brought this on us.\n\nIn the darkness Farah puts her arms around him, holds him.\n\nFARAH\nYou are brave and good. If this tomb is to be ours... at least the Dagger will be buried with us. And... we are together.\n\nIn the silence...\n\nFARAH\nWhat is it?\n\nPRINCE\nNothing.\n\nFARAH\nYou’re trembling!\n\nPRINCE\n(claustrophobic)\nI just don’t like close spaces. There must be some way out of here.\n\nSilence.\n\nFARAH\nWhen I was small, my mother taught me a secret word. She said that when I was afraid, all I had to do was speak that word and a magic door would open.\n(pause)\nI’ve never told that to anybody.\n\nPRINCE\nI can see why. It’s the most childish thing I’ve ever heard of.\n(pause)\nWhat was the word?\nFARAH (O.S.)\n‘Kakolookiyam.’\n\nAs she says the words, there is a noise like stone sliding against stone. More scuffling sounds.\n\nPRINCE (O.S.)\nYou did that. Didn’t you?\n\nNo reply.\n\nPRINCE (O.S.)\nFarah?\n\nThe TORCHES ILLUMINATE again, revealing the room. The Prince is alone. The slab has been moved.\nGame Play : Magic Cavern\nIn a dreamlike sequence, the Prince descends a flight of stairs into the tomb, and finds Farah in a place that is not quite real.\n\nINT. MAGIC CAVERN\nFarah is already in the room, staring with delight at something off-camera. As the Prince comes up beside her, she takes his hand.\n\nFARAH\nIt’s beautiful.\n\nThey both stand there staring at the same incredible sight. Farah grins suddenly with childlike delight. She runs offscreen. We HEAR A SPLASH.\n\nFARAH IN THE POOL\n\nFarah surfaces in a tiled pool, from which steam rises invitingly.\n\nFARAH\nCome on!\n\nTHE PRINCE\n\nadvances in disbelief, taking in their surroundings.\n\nA table with a jug of wine and fresh fruit. A luxurious bed with silk pillows and draperies. Hundreds of lit candles illuminate a room fit for a prince and princess’s honeymoon.\n\nThe Prince descends the tiled steps into the pool. As he approaches, Farah swims backward, treading water. A slight teasing smile on her lips.\n\nAs the Prince exits frame, HOLD on the empty wall. The flickering candlelight casts SILHOUETTES of Farah and the Prince on the wall.\n\nSILHOUETTES ON THE WALL\n\nThe Prince advances, waist-high in the water. Farah treads water with only her head visible.\n\nThen Farah stands. Faces the Prince. Takes off whatever she’s wearing. We only see their shadows.\n\nPRINCE\n(with hushed reverence)\nKakolookiyam.\n\nThe shadows embrace, kiss.\n\nFADE OUT.\n\nINT. TOMB --- DAY (AFTER SANDSTORM)\n\nThe Prince awakens with a start, as if from a dream. As he looks around the room, his eyes fall on ---\n\nHis clothing and sandals, in a heap on the floor. No dagger. And no sword.\n\nIt was no dream.\nGame Play : Tomb\nIn the cold light of morning, the tomb is just a plain mausoleum, with no magic stairway. Farah is gone. The Prince finds the way out.\nEXT. SAND DRIFT --- DAY\n\nThe Prince climbs out of a sand drift; shakes off sand. He stands there blinking incredulously into the bright daylight.\n\nWHAT HE SEES\n\nPANORAMIC VIEW of the entire palace buried in sand. Only the highest minarets, including the upper part of the Tower of Dawn, are visible. The rest is buried.\n\nTHE PRINCE\n\nThe SHRIEK of a Sand Bird attracts his attention. He looks up to see Farah climbing the Tower of Dawn with grim determination. She holds the Prince's dagger in one hand, his old sword --- too heavy for her --- in the other.\n\nPRINCE\nFarah! No!\n\nShe glances back over her shoulder --- then climbs on, ignoring him. SAND BIRDS circle her like vultures.\nGame Play : Tower of Dawn\nBeset by Sand Birds, the Prince climbs the tower after Farah, and finds a magic sword to replace the one she stole. Though handicapped by not having the dagger, he manages to reach the top of the tower…\nEXT. TOWER OF DAWN ROOFTOP – DAY\n\nFarah faces the Sand Giffin.\n\nThe Dagger in one hand, she awkwardly swings the heavy sword with the other. The Griffin SNARLS; lunges at her. Farah holds it off.\n\nTHE PRINCE\n\nreaches the top and is horrified by the sight.\n\nPRINCE\nFARAH!!\n\nFarah turns at the sound of his voice. The Griffin strikes her a mighty blow with its claw, knocking the sword from her hand and smashing a hole in the roof.\n\nThe roof caves in beneath Farah’s feet. As she falls, she manages to grab the edge of the hole. She still has the Dagger.\n\nThe Prince runs toward her...\n\nFarah desperately tries to climb back up to safety...\n\nJust as the Prince reaches Farah, a large chunk of roof breaks off and she falls. The Prince lunges and grabs the dagger in her hand --- by the blade.\n\nThe Prince grimaces with determination. His grip tightens on the blade; he is bearing Farah’s entire weight. That’s got to hurt.\n\nA thin line of blood trickles from his fist. A drop lands on Farah’s cheek.\n\nShe looks at him. In her eyes we see love, understanding... and, finally, peace.\n\nFARAH\n(a whisper)\nKakolookiyam.\n\nPRINCE\nFarah, no!\n\nShe lets go of the dagger. And falls.\n\nThe Prince scrambles to the edge of the hole. Looks down. His expression is pure horror.\n\nWHAT HE SEES: Farah lying dead at the bottom of the hole, far below in the Hourglass Room. A drop of blood on her cheek.\n\nTHE SAND GRIFFIN\n\nstrikes the Prince from behind, sending him sprawling. With a snarl, the monster advances on him.\n\nThe Prince’s expression transforms to grim determination. Drawing his sword, he rises to his feet to face the Sand Griffin. This is going to be the fight of his life.\n\nGame Play : Tower of Dawn\nThe Prince defeats the Sand Griffin for the last time, and descends into the Hourglass Room…\n\nINT. HOURGLASS ROOM --- DAY\n\nFarah lies motionless amid the debris of the fallen rooftop. The Prince rushes to her side, lifts her in his arms. She is dead.\n\nPRINCE\nNo. No.\n\nLost in grief, the Prince fails to notice the shadow passing over him, as the Vizier steals up on him from behind...\n\nThe Prince whirls with lightning speed. Before the Vizier can strike, the Prince snatches his staff and flings it away. In an instant the Vizier is flat on his back, the Prince crouched over him like a tiger, eyes blazing, dagger raised to kill.\n\nVIZIER\n(between gasps)\nThe girl... is unimportant. Give me the dagger... and I will give you power such as no king since  Suleyman has dreamed of. Eternal Life... will be yours.\n\nThe Prince’s eyes narrow with hatred.\n\nPRINCE\nLive forever... when those I loved are dead, and I to blame! I choose Death.\n\nThe Vizier gleams with anticipation, fully expecting the Prince to strike the dagger into his heart. Oddly, this prospect seems to fill the Vizier not with fear, but exaltation. But before we can wonder why...\n\nInstead of striking the fatal blow, the Prince vaults off the Vizier and runs up the wall, from which he executes a brilliant rebound, landing on top of the hourglass.\n\nStanding atop the hourglass, the Prince raises the dagger high, blazing with determination.\n\nThe Vizier realizes what's about to happen. His eyes go wide with terror ---\n\nVIZIER\nNO!!!!!!\n\nThe Prince PLUNGES the dagger into the center of the sun. A BLINDING BURST OF LIGHT. Like a nuclear blast.\n\nTHE BIGGEST REWIND OF ALL.\n\nPRINCE (V.O.)\nBravely I had fought, and slain my enemies. Honor and glory were mine. But though I fight until the desert sands themselves were red with blood... I could not bring back the dead.\nIt starts out slow: the dagger comes up out of the hourglass, the Prince reverses his jump and walling move...\n\n...then faster: Farah rises up out of the caved-in roof, which reassembles...\n\n...Faster and faster, a jumble of fragmented images from the game, hours now compressed into seconds...\n\n...at last slowing again to viewable speed, as the Prince gallops backwards through a battle between Indian and Persian soldiers...\n\nINT. FARAH'S BEDROOM --- NIGHT\n\nFarah awakens in bed with a gasp.\n\nINT. TENT --- NIGHT\n\nAt the same instant, the Prince is likewise startled awake.\n\nClutched in his hand is the Dagger. He looks at it as if seeing it for the first time. Then looks around, getting his bearings. He is in a small tent. NIGHT SOUNDS.\n\nEXT. MILITARY ENCAMPMENT --- NIGHT\n\nThe Prince emerges from his tent and looks around.\n\nPULL BACK TO REVEAL that his tent is one of a hundred like it. The Persian Army is camped on an Indian plain. We see horses tied up, a few Persian soldiers on guard. The rest of the army is asleep in their tents.\n\nHearing voices, the Prince sneaks up on a larger tent nearby, and eavesdrops. We SEE SHADOWS of Shahraman and a Soldier inside.\n\nSOLDIER (O.S.)\n...And at dawn, we march.\n\nSHAHRAMAN (O.S.)\nA great deal depends upon this traitor. If he should fail?\n\nSOLDIER (O.S.)\nYour Majesty, he will signal with a flaming arrow shot into the air. When we see it, we attack. And not before.\n\nThe Prince backs away from the tent... turns, and runs off into the night.\n\nEXT. JUNGLE --- NIGHT\n\nThe PRINCE runs through a dense jungle, pushing aside branches. Grim determination is on his face, as if he is on his way to save the world. In fact, he is.\n\nThe Prince reaches the edge of the jungle, and pauses, pushing aside leaves...\n\nWHAT HE SEES\n\nThe Maharajah's palace compound, lying just beyond the edge of the jungle.\n\nINT. FARAH'S BEDROOM --- NIGHT\n\nFarah, awakened, gets out of bed in her nightgown. Pushing aside the translucent curtains, she walks to the edge of her balcony and looks out. NIGHT SOUNDS.\n\nWHAT SHE SEES\n\nThe edge of the jungle (reverse POV of what the Prince saw in previous shot).\n\nFARAH\n\nHearing a sound, she whirls suddenly with a frightened gasp to see the Prince standing on her balcony.\n\nPRINCE\nDo not be afraid.\n\nFarah shrinks back as the Prince advances on her. She is very much afraid --- but her expression suggests that if he attacks her, she'll fight back anyway.\n\nHer eyes widen in fear as the Prince draws a dagger. To her surprise, instead of attacking, he offers it to her, handle first.\n\nPRINCE\nThis belongs to you.\n\nFarah looks at the dagger. To her confusion, she recognizes it. Her hand flies unconsciously to touch the medallion at her throat, an instinctive gesture.\n\nFARAH\nThe Dagger of Time! But it is locked away within my father's treasure vault! How ---\n\nPRINCE\nMost people think time is like a river that flows swift and sure in one direction. But I have seen the face of Time, and I can tell you... they are wrong. Time is an ocean in a storm.\n\nFarah looks at him with the first sign of interest.\n\nPRINCE [O.S.]\nYou may wonder who I am and why I say this. Sit down, and I will tell you a tale like none that you have ever heard.\n\nFarah sits down on a pillow. On her listening face, DISSOLVE TO...\n\nEXT. MAHARAJAH'S PALACE --- DAWN\n\nAs the Prince's talking voice fades out, we HEAR PRINCE'S VOICE-OVER, as we have heard it throughout the game:\n\nPRINCE [O.S.]\n...And that is why I have come. To warn you and your father to arrest this treacherous Vizier before he betrays you, and brings ruin on us all.\n\nINT. FARAH'S BEDROOM --- DAWN\n\nFarah sits listening to the Prince finish his story, which has taken him all night to tell.\n\nPRINCE\nHis signal is a flaming arrow shot into the air. Prevent him, and my father's army will know the traitor has been unmasked. They will turn back.\n\nHis voice and expression plead with her to believe him. Farah still seems undecided... Then, a DRY COUGH from the shadows makes them both turn.\n\nVIZIER\nA wild tale, indeed. I have a simpler version.\n\nThe Vizier steps out of the shadows.\n\nVIZIER\nA Persian soldier, lusting for glory, entered the chambers of the Maharajah's daughter and was slain --- by me.\n\nMagic staff in hand, the Vizier advances menacingly toward the Prince. The Prince scowls. Draws his sword.\n\nGame Play : Farah’s Bedroom\nThe Vizier attacks the Prince using magic. The Prince defends himself with a sword. The battle ends outside on the balcony.\n\nEXT. EDGE OF JUNGLE --- DAWN\n\nThe Vizier staggers, mortally wounded. With a baffled expression on his face, he crumples to his knees.\n\nVIZIER\nI could have been... immortal.\n\nAnd he falls. The Prince stands there, sword in hand, a weary warrior. He turns to see Farah staring in wonderment.\n\nFARAH\nThen it's true. He was a traitor.\n\nPRINCE\n(extends the dagger)\nTake this. Return it to your father's treasure vault. Guard it well.\n\nFarah does not reach for it.\n\nFARAH\n(slowly)\nI owe you thanks. But why did you invent such a fantastic story? Do you think me a child, that I would believe such nonsense?\n\nFrustrated, the Prince grabs Farah in his arms and gives her a passionate kiss. She struggles against him, finally escapes with a violent shove.\n\nFARAH\n(coldly)\nI said I owe you thanks. You presume too much.\n\nThe Prince looks resigned. Before Farah's eyes, he lifts the dagger... and PRESSES THE REWIND SWITCH.\n\nFAST REWIND, reversing the kiss, and stopping on ---\n\nFARAH\n(exact replay)\n...such a fantastic story? Do you think me a child, that I would believe such nonsense?\n\nThe Prince sighs: he'll never convince her. In his eyes is a new maturity, tinged with gentle regret. He places the dagger into her hands.\n\nPRINCE\nYou're right. It was just a story.\n\nFarah looks relieved. The Prince turns to head back into the jungle. As he climbs up onto a giant fallen tree –-\n\nFARAH\nWait!\n(The Prince turns)\nI don't even know your name.\n\nThe Prince hesitates. Then inspiration strikes.\n\nPRINCE\nJust call me... Kakolookiyam!\n\nWith a wink, he jumps down, and vanishes into the jungle.\n\nFARAH\n\nwonders: How could he possibly have known that?\n\nShe wrestles with it. Giving up, she turns away... Looks down at the dagger in her hands... Then looks back. A doubt in her eyes.\n\nAs she debates, we PULL BACK until Farah is just a small figure standing at the edge of the clearing... Behind her, the safety of the palace; before her, the vast impenetrable darkness of the jungle.\n\nROLL END CREDITS.6Embed"
    }
}