{
    "id": "ML417",
    "mood": "relaxed",
    "artist": "The Corrs",
    "title": "Baby Be Brave (album version)",
    "song": {
        "_type": "song",
        "annotation_count": 1,
        "api_path": "/songs/6948926",
        "artist_names": "Genius Korea",
        "full_title": "Genius Korea Community’s Favorite Albums Of 2021 So Far by Genius Korea",
        "header_image_thumbnail_url": "https://images.genius.com/8210b4a984709d8cbfe9a2f0b4c80f94.300x200x1.jpg",
        "header_image_url": "https://images.genius.com/8210b4a984709d8cbfe9a2f0b4c80f94.1000x667x1.jpg",
        "id": 6948926,
        "instrumental": false,
        "language": "en",
        "lyrics_owner_id": 2557222,
        "lyrics_state": "complete",
        "lyrics_updated_at": 1626156704,
        "path": "/Genius-korea-genius-korea-communitys-favorite-albums-of-2021-so-far-annotated",
        "pyongs_count": 3,
        "relationships_index_url": "https://genius.com/Genius-korea-genius-korea-communitys-favorite-albums-of-2021-so-far-sample",
        "release_date_components": {
            "year": 2021,
            "month": 7,
            "day": 1
        },
        "release_date_for_display": "July 1, 2021",
        "release_date_with_abbreviated_month_for_display": "Jul. 1, 2021",
        "song_art_image_thumbnail_url": "https://images.genius.com/ebcfcc5469850389588b215aed1337e4.300x300x1.jpg",
        "song_art_image_url": "https://images.genius.com/ebcfcc5469850389588b215aed1337e4.1000x1000x1.jpg",
        "stats": {
            "unreviewed_annotations": 0,
            "hot": false,
            "pageviews": 5022
        },
        "title": "Genius Korea Community’s Favorite Albums Of 2021 So Far",
        "title_with_featured": "Genius Korea Community’s Favorite Albums Of 2021 So Far",
        "updated_by_human_at": 1626157614,
        "url": "https://genius.com/Genius-korea-genius-korea-communitys-favorite-albums-of-2021-so-far-annotated",
        "featured_artists": [],
        "primary_artist": {
            "_type": "artist",
            "api_path": "/artists/2329789",
            "header_image_url": "https://images.genius.com/10e410f816347c831420e42e1614dd98.1000x369x1.jpg",
            "id": 2329789,
            "image_url": "https://images.genius.com/ee2051daa14f63169f303394c89069d8.1000x1000x1.jpg",
            "index_character": "g",
            "is_meme_verified": false,
            "is_verified": true,
            "name": "Genius Korea",
            "slug": "Genius-korea",
            "url": "https://genius.com/artists/Genius-korea",
            "iq": 264
        },
        "artist": "Genius Korea",
        "lyrics": "Genius Korea Community’s Favorite Albums Of 2021 So Far LyricsHot Sauce - NCT DREAMOriginal Album | Romanization | English Translation\n'Hot Sauce' is a cohesive yet diverse album. The title track encapsulates this very well with the Spanish vocal sample (+the distorted version used in verses) as well as the rapid pace and the chanting on the second refrain. It kind of (albeit very subtly) reminded me of Hitchhiker-produced tracks like 127's \"MAD DOG.\" It's followed by \"Diggity,\" which combines hard, punchy, and experimental elеments with DREAM's cute aesthеtic - making it a fan favorite among many.  \"Dive Into You\" is one of my two personal preferred songs out of all the B-sides. The strong bassline brings power to the rap verses and drops off for harmonic, melody-driven pre-chorus, only to come back bigger immediately after. The soft slowdown at the end perfectly leads into \"My Youth.\" \"Rocket\" gives me the vibe that I'm literally blasting off to space and, at some points, feels like I'm riding a Ferris wheel or doing something of the sort at an amusement park. My second preferred song out of the tracklist is \"Countdown (3, 2, 1).\" The best part is the final verse that comes back unexpectedly after the chorus to bring back the track's punchy energy. It definitely did a good job of giving the impression that something big was about to happen. \"ANL\" makes me feel like it's just rained and the sun is coming back out from the clouds (and also brings me a strange sense of nostalgia). \"Irreplaceable,\" tells the story of an energizing love with a forever lover - and you don't even need to understand a word to know that. And, finally, \"Be There For You\" and \"Rainbow\" are heartfelt ballads that sound like they could fit right into an OST.  Overall, there wasn't a miss on NCT DREAM's latest fully-new release and I'll happily listen to the whole thing over again many times. It was even followed by the 'Hello Future' repackage.\n\n—ckrQuerencia - CHUNG HAOriginal Album | Romanization | English Translation\nThis being CHUNG HA's first studio album, it was expected to exceed expectations! And oh, it did! The album explored a long list of genres thanks to the album's separation into four \"sides\" (NOBLE, SAVAGE, UNKNOWN and PLEASURES). Each side gives off different vibes and rhythms, taking the audience on a rollercoaster of emotions! As for the concept, Querencia (an abstract concept in Spanish) is referring to a place where one can be one’s true self/or to desire. The album truly does justice to the concept of where you can be your true self with the wide range of meaning into the tracks, making it an album that suits every mood. In some instances, the difficulties of a relationship, that \"it’s OK not to be fine\", to show empowerment and confidence, to pick yourself up and come back stronger than those who have betrayed you. At first, I was skeptical of the 21 tracks but I was just blown away! Of course, never doubt Chungha! With hardly any tracks to skip, the album contains everything that fans have come to love about the soloist. I would say my favorite track of the album would be \"Demente ft. Guaynaa\" (including the Spanish Version). The melody and lyrics, just awesome! It is an album to remember and revisit no matter how you are feeling because it has something for everyone!\n\n—HobschiskeWhimsical - Jung Jin HyeongOriginal Album\nI have been well aware of Jung Jin Hyeong’s musical talent for a while, but with the artist’s first full-length album Whimsical, Jin Hyeong undeniably solidifies his place within the South Korean R&B scene. With all of the songs written and composed by the singer himself and each and every one of them being extremely enjoyable, Jung Jin Hyeong’s debut album is a whirlwind of exquisitely performed R&B songs with hints of hip-hop; starting with the title track “Back” and its groovy sound that is followed by marvelous electric guitar notes—a first for the South Korean artist—that makes a strong start for the album. The participation of crewmates Theo and Blase is requested in “No time” and “Drive” respectively, adding an unexpected edge to each song; the former is a darker track led by its slow beat and acoustic guitar sound, the latter being an upbeat disco-inspired song that vaguely reminds me of electronic music legends Daft Punk, which instantly makes it one of my favorites in the album. But my absolute favorite track is presented in the form of “Downtown,” a Latin-inspired groovy conveyance of a song that urges people to stand up and dance. Jin Hyeong’s charms are further extended to “Drunken texts,” “Hours,” and “Alarm,” all different yet equally delightful, with creative lyrics entrusted by the singer’s characteristic sweet and mellow vocals. The final song, a pre-released single featuring hip-hop geniuses pH-1 and Sik-K carrying the name of “Lies,” is the perfect closure to an album like Whimsical, with its catchy chorus and the rappers’ additional charisma. It is worth mentioning and recognizing the work of Vangdale, producer of all of the songs in the album, as he was able to seamlessly and flawlessly create different worlds within each song. That being said, Jung Jin Hyeong’s debut album, Whimsical, is an assertive piece of work, as it ensures that the listener will be drawn by the artist’s witty lyrical work and incredible musical sense.\n—loveholicGUESS WHO - ITZYOriginal Album | Romanization | English Translation\nITZY's 'Guess Who' does a good job communicating a broad theme revolving around the rebellious nature of outlaws. The title track, \"마.피.아. (MAFIA) IN THE MORNING,\" appears to narrate a sly and cunning woman in love - stealing a heart and using her so-called trickery to get what she wants. The slick (almost eerie) sound of the instrumental towards the beginning perfectly builds upon this. \"Sorry Not Sorry\" is an anthem of confidence in their abilities and decisions. There's also clearly a thirst to overachieve, fly past all obstacles, and stop at nothing. The heavy guitar strums really top this one-off. Following is \"KIDDING ME,\" which communicates taking a stand against a partner who isn't as committed as you are. The chopped and harsh yet somehow smooth sample that comes in during the chorus communicates strong words and a new beginning perfectly. \"Wild Wild West\" communicates the mean side that one may take in a relationship  (thorns) with a lover that is willing to be there unconditionally even knowing that fact. Some people love a little danger - that's what makes the wild west so appealing. \"SHOOT!\" is about shooting your shot with someone you love deeply, but staying true to yourself and not bending to fit their desires. It alludes to the film Red Shoes and the Seven Dwarfs - the attractive allure that Red Shoes had when she put them on. In my opinion, this instrumental is by far the funkiest on the album and the creative use of vocal tuning helps a lot to create the feel. Finally, \"TENNIS (0:0)\" is a soft, cozy tone change that acts as a send-off for the project. The acoustic and bass sounds build this well. Overall, 'Guess Who' screams healthy confidence with a bit of vulnerability when needed. I'd definitely listen to it again!\n\n—ckrThe Chaos Chapter: FREEZE - TOMORROW X TOGETHEROriginal Album | Romanization | English Translation\nLeaders of the fourth generation of K-Pop are back with their third full-length album—The Chaos Chapter: FREEZE. The album is very strong in terms of music, and at the same time, the group freely tries different musical genres and styles, which gives a very natural, pleasant-to-the-ear effect. The subject of the songs still oscillates around the highs and lows of their boy lives on the verge of being teens and young adults. It is also significant that all the members were actively involved in the creation of the album, which makes it even more personal—they all wrote the lyrics, and HUENINGKAI co-produced one of the songs (\"Dear Sputnik.\") The main point of the album is the title track, an emo-rock song \"0X1=LOVESONG (I Know I Love You)\" featuring South Korean R&B singer, Seori. The song is followed by the band's first English song, an upbeat, funky \"Magic,\" which perfectly emphasizes the dancing abilities of the group during performances. When talking about the best songs from the album, it is impossible not to mention \"Anti-Romantic,\" the soft synth-pop ballad that works as the album opener, shows youth's intense feelings of falling in and out of love. The album debuted at No. 5 on Billboard 200 albums chart (a weekly ranking of the most popular albums in the United States) making TXT the third K-Pop group in history to chart multiple albums on the chart in the same year, placing them in the company of BTS and TWICE.\n\n—SiannveSummer Queen - Brave GirlsOriginal Album | Romanization | English Translation\nAs a fan of Brave Girls when \"We Ride\" was released even and before \"Rollin'\" gained the huge success, I was really excited to see what other concepts that the current lineup could show since there wasn't really much information about them then. Summer Queen was the perfect example of what I would've been looking for. A mini-album that you could listen to while you're having fun outdoors, or just chilling by yourself during summer! The first track \"치맛바람 (Chi Mat Ba Ram)\" is an upbeat song that showcases their unique voices, especially in the chorus. In my opinion, the English version of the song gives off a stronger feeling. Overall, it was a really memorable song and Yuna's line \"Now I'm fearless\" has been stuck in my head since forever. The album has a promotional b-side called \"Pool Party\" which I love a lot because of the retro vibe I get from it. Perfect song if you're going out rollerskating or to a pool party! My favorite on the album \"나 혼자 여름 (Summer by myself)\" is all I could ask for a summer song. Smooth producer tag intro? Check. Memorable lyrics and melody? Check. A catchy verse that Eunji and Yujeong participate in? Check! Now on to \"FEVER\". I love this song a lot, of course! It's one of the most chill songs I've ever listened to in my life and in the most positive way ever. I feel like listening to this song if I ever get a fever honestly. If you're a fan of girl groups that know how to make a variety of good summer songs, I suggest you try Brave Girls out!\n\n—seokyoungTaste Of Love - TWICEOriginal Album | Romanization | English Translation\nServing as the tenth mini-album from TWICE, Taste Of Love expresses the girl group’s maturation as they move away from prior “girlish” concepts and find themselves confronting intense emotions to coincidental encounters. Notably, it even features writing credits from four out of the nine members: Jihyo, Dahyun, Sana and Nayeon. Beginning with a metaphor for being drunk on love, “Alcohol-Free” instantaneously sets the summer theme off by its incorporation of elements derived from Bossa nova style of samba. I’d say it’d be the understatement of the year to admit I’m a *little* obsessed with Dahyun and Chaeyoung’s rap; their flow is as cool as a “mojito with lime” on a hot summer’s day and I wish it were longer! With “First Time,” I think we can all relate to the butterflies felt when realizing you’re falling in love with somebody. Seductively, the bass guitar allows amplifying these electrifying feelings. I also believe the post-chorus is undeniably catchy with the shouts of “hey!” In retrospect, the one thing that stood out to me was those heavenly falsettos. Furthermore, Jade Thirwall from Little Mix aided the songwriting on this track, helping to encapsulate the feeling of the one language we’re all fluent in: love. Moving on… did Chaeyoungs’s whispers catch you off-guard? ‘Cause, they sure did for me! The continuation of the groovy guitar pickings in “Scandal,” this time paired with powerful piano chords, demonstrate TWICE's newfound confidence when exploring a riskier, more flirtatious side of love. In turn, “Conversation” ventures forwards into a mellow, laidback sound at first. The bubby synth keys help to assist this approach, but when the chorus is reached, we’re introduced to a ritzy bassline. Personally, this is my favorite song on the album - albeit the shortest track, standing at just under 2 minutes and 30 seconds, it takes nothing away from the elegance and sensuality TWICE showcase. “Baby Blue Love” is a real dance-pop vibe, a call-back to the retro 70s/80s shimmering disco-era. Honestly, the urge to get up and dance is almost irresistible. From the title itself, the color baby blue connotes making free-spirited, carefree memories. Finally, “SOS” is precisely the ending we needed to this saga of infatuation. Closing off with more light-hearted fun and thrills, the girls savoring each and every moment spent with their lover, I didn’t think it was possible for TWICE to make a summer-themed album where every track evoked a similar atmosphere, yet was diverse in the manner it was brought out and sung about. Over the years, TWICE have perfected their mellifluous vocals and have been more eager to experiment. If anything, this album is an exquisite example of that, and I am very much excited to create my own memories this summer!\n\n—ZealotOfStockholmRedd - Whee In Original Album | Romanization | English Translation\nAs a big fan of MAMAMOO's R&B vocals and sassy rap verses, I was very excited to check out Whee In's Redd. Starting with the catchy title track \"watercolor,\" she gives an empowering message about self-improvement: It's okay to be selfish if it means you're following your dreams and you're staying true to yourself. Then we have \"Trash,\" featuring rapper pH-1. The intimate track is about showing the pretty and ugly parts of yourself to the person you love. While that may be scary at first, the undeniable passion ends up winning. Contrasting the previous piece, \"OHOO\" is a laid-down love song, perfect to listen to when the sun is setting or when it's raining. If you came for soulful R&B, \"Butterfly\" will be your favorite, featuring the great GSoul. The beautiful and calming melodies create a story about finding 'the one' in your dreams and learning to let go so you can wake up from the fantasy. My highlight is the ending, where both vocalists harmonize and create a new atmosphere together. \"봄이 너에게 (Springtime)\" is a cute love letter to Whee In's fans, where she thanks them for always being there for her and brightening her days. Finally, we have my favorite track off the mini-album, \"NO THANKS.\" I tend to love lyrically angsty songs that sound happy, even while tracks like \"Trash\" or \"OHOO\" are more relatable than ever for me right now.  With Redd, Whee In tells an engaging narrative about learning to know your worth so you can experience the love you deserve at last.\n\n—EleventhCassetteLilac - IUOriginal Album | Romanization | English Translation\nActing as a bridge between her 20s and 30s, LILAC is a cathartic album by the Korean singer-songwriter, IU. Running with her theme of age-related projects, the singer brings comfort to her fans on this album. Containing extremely relatable lyrics, at least relatable to me and most people I know, LILAC had a track for every moment. Sonically, the album is a perfect modern pop album, from 2000s R&B to 80s disco-pop to soaring orchestral ballads, IU shares every aspect of herself that we have grown to love. While the lead single is an explosion of springtime excitement like the blossoming of lilacs, I think the album’s real gems lie in the B-side tracks like “Troll” featuring R&B artist DEAN (side note I need new music from DEAN), the bubblegum-pop, “어푸 (Ah puh),” “Coin,” \"아이와 나의 바다 (My sea)\" and “Flu.” One thing I love about IU's albums is the incredible songwriting collaborations. It shows that she can fit into any style possible, LILAC's credits contain several prominent Korean songwriters including Lee Chan Hyuk, PENOMECO, JUNNY, Sumin, and hitmaker Ryan S. Jhun. IU amplifies her relatable personality through her music and lyrics and LILAC is the perfect example of it.\n\n—ssaa10decSTAYDOM - STAYCOriginal Album | Romanization | English Translation\nAfter the powerful entrance STAYC made to the K-Pop genre in late 2020, making them my favorite girl group debut of the year, the group’s much-anticipated first mini-album STAYDOM was released in April of 2021. Compelled of four songs, this delivery emphasizes the group’s intention of making an impact and gaining their own place in the industry. With unmatched vocals and fun choreography, the lead single “ASAP” is an infectious and bubbly refreshing song that positively assures the group’s duality, compared to debut song “SO BAD.” Though based on my taste, their B-side tracks are what shines the most. The confidence-inducing track with a catchy and melodic tune “SO WHAT” encourages the listener to be their own self, regardless of other people’s opinions. My preferred track, “사랑은 원래 이렇게 아픈 건가요 (LOVE FOOL)” is an easy-to-listen and sweet slow-paced mixture of the members’ diverse vocal colors and meaningful lyrics. Both songs reach their peak during the bridge, both unique yet addicting in the same kind of way. Ending with a remix of “SO BAD,” TAK lends his artistic abilities that make for a song perfect for performances. To say I am excited about STAYC’s future releases is very little compared to the relentless anticipation I have as I look forward to the undeniable success that STAYC will face as they dive more into their talent.\n\n—loveholicEpik High Is Here 上 - EPIK HIGHOriginal Album | Romanization | English Translation\nThe calm, the storm, and the duality of the butterfly meet on Epik High is Here 上. As an ARMY, I've always been aware of the group, but not so much of their music. But just like how the doors open and close as the pandemic progresses for better or for worse, Epik High proves to be a meaningful catch of hope and ambition in spite of the gloomy future. I would like to recap some of my favorite moments of the album. 'Lesson 0\", a sentimental song driven by piano chords, describes the search for an answer that might not exist. Ending on a perfect resolution, the song suggests that some solution has been proposed. Coming up right after, \"Rosario\" plays with the duality of the butterfly; the song is as \"mellow\" as hearing gunshots in close distance. Ambitious and aggressive, and featuring other A-listers in the game, the song is a rose with pointy thorns. The classical instrumental of \"내 얘기 같아 (Based on a True Story)\" is as intricate as real love stories themselves. The group wonders why they are reacting so personally to fictional romance; and how ironically, they can only answer with words similar to \"I don't know nan molla.\" \"수상소감 (Acceptance Speech)\" accepts the pressure of fame; it accepts that just like how \"Black clouds are still clouds,\" gold chains are still chains. \"True Crime\" is the song with the EDM-infused chorus, the calm before the storm—when you're driving down a peaceful tunnel that you hope is endless. \"Social Distancing 16\" is short and telling about the music industry within 16 bars; the flow is immaculate despite switching between Tablo and Mithra Jin. Tablo's opening rap verse in \"End of the World\" is as smooth and delightful as sliding into a diner booth, only then to be served with the truth in his verse.\n\n—ANC613WATERFALL - B.IOriginal Album | Romanization | English Translation\nI was going to choose “Numb” to be featured in the Songs List, however, it is quite impossible to single out one song to represent the album. I will admit, I am a fairly new fan of Hanbin. I always knew of him as a songwriter, but I never paid attention to his lyrics on a deeper level. Hanbin’s ability to share a heartbreaking and depressing story through his lyrics but still make the track sound like a summer bop is perfectly on display on WATERFALL. Hanbin also known as B.I professionally expertly hides his pain in the album’s lyrics. Some of the highlights on the album include previously mentioned rock ballad, “Numb,” “Then,” “Illusion,” \"Help Me\" and “Daydream” which also features longtime friend, Lee Hi. Storytelling takes center stage on the album, considering the public scrutiny the artist has faced in the past. Being his first full-length album, WATERFALL becomes an outlet for Hanbin to share his truth. While the production is simple and minimalistic, B.I still incorporates rock, hip-hop, funk, pop, jazz, and ballad sounds in the album. One of my favorite things is when a rapper sings and sounds phenomenal and we hear it once again on the album. The album contains some of B.I’s best vocal deliveries and amidst the heartbreak and darkness, Hanbin manages to find hope and light on WATERFALL which is what makes this album one of the best of the year.\n\n—ssaa10decFragile - eAeonOriginal Album | Romanization | English Translation\neAeon, the Korean singer-songwriter, also known for being the leader of indie band 못 (Mot), returned after nine years with his solo album, Fragile. The release is a very interestingly working mixture of synth-pop and lo-fi, with very honest, vulnerable lyrics and 'love' as a metaphor to talk about fragility throughout the whole album. One of the most interesting songs are \"왜일까 (I Wonder),\" which creates the vibe that could easily be the soundtrack to the film, probably some dark drama or a spy movie, and \"어쩌면 (Maybe),\" one of the singles released prior the album, that will make you think about changes, and impact other people make in our lives. For this album, eAeon also collaborated with a R&B singer Jclef (\"Null\"), rapper Swervy (\"Mad Tea Party\"), and rapper-songwriter-composer RM (\"그러지 마 (Don't)\"). The latter is probably the most known off the album (deservedly). \"그러지 마 (Don't),\" the story of the relationship gradually falling apart, is not their first collaboration, and once again they created a very unique piece, as both artists share a similar musical sensitivity, and they hold great respect for each other, which translates into the results of their joint work. That being said, despite the rather gloomy subject of the lyrics, the whole album is oddly comforting and definitely worth listening to as we all have the fragility to embrace.\n\n—SiannveTHE FIRST STEP : TREASURE EFFECT - TREASUREOriginal Album | Romanization | English Translation\nTREASURE's first full-length project, THE FIRST STEP : TREASURE EFFECT, showcases the rookies' potential across a multitude of styles. The project includes their first single albums, and I was worried this mesh of drastically different genres would take away from the listening experience. However, the album's musical diversity allows anyone to experience the full treasure effect. TREASURE's first few releases (tracks 4-7) all followed a YG-style EDM approach, making their mark as YG's newest boy group. Their debut \"BOY\" is honestly quite reminiscent of \"DDU-DU DDU-DU\" in terms of sound and structure. Though they formed this EDM image, it didn't restrict them from exploring other genres. \"음 (MMM)\" threw in a hip-hop twist, showcasing more rap than anywhere else on the album. The title track \"MY TREASURE\" is a youthful song with an uplifting message, one that fits their group name TREASURE – encouraging listeners to keep their heads high on gloomy days and learn to \"treasure\" what they have (themselves). The other B-side tracks on the album also have a bit of everything: \"미쳐가네 (GOING CRAZY)\" is a house track reminiscent of BIGBANG-era K-Pop while \"나랑 있자 (BE WITH ME)\" is a guitar-based acoustic song with a bit of bass and a whistle hook-line. Members' diverse talents are showcased as well, with Asahi co-producing the ballad \"오렌지 (Orange)\" and Hyunsuk, Haruto and Yoshi writing most of their raps for the album. They also have strong vocals: Jeongwoo and Jihoon showcased their vocal potential on \"사랑해 (I Love You)\" and \"B.L.T (BLING LIKE THIS),\" and you can really hear Yedam and his vocals throughout the album; He's finally singing on his own songs. The tracklist is topped off by the Lee Chan Hyuk-penned \"SLOWMOTION,\" a slow song dedicated to the group's journey so far. I can't wait to hear what musical direction TREASURE take in the future. This project is diverse, but remember, it's only the first step.\n\n—PlanNine16Instinct Part 1 - OnlyOneOfOriginal Album | Romanization | English Translation\nThis rookie almost obscure boy group made a lot of buzz this spring with their unique (risque) concept. OnlyOneOf who debuted in 2019 has always incorporated unique themes and concepts in their releases. For fans of the group, it came as no surprise that the group was once again looking towards combining philosophy, art, and music to create thought-provoking songs. Instinct Part 1 is the group’s third mini-album and takes inspiration from Sigmund Freud’s theories of mind. Supported by the title track, “libidO,” Instinct Part 1 explores the themes of intimacy that humans crave especially teenagers. Despite garnering much attention due to its sexy and sensual choreography and visuals, I think it is also important to appreciate the depth in the concept of this album. In a year where most of us were confined to our homes and many times all alone, we all craved intimacy at different levels and in different ways. OnlyOneOf beautifully explored this subconscious drive that we all have on B-side tracks “instinct/본능” and \"byredO\". They also talk about the repercussions of the instinct, both when it becomes overbearing or when it is suppressed. Featuring instrumental interludes, Instinct Part 1 is masterfully crafted making it one of the standout albums of 2021 so far. I truly believe that OnlyOneOf has a bright future credited to their unique discography amplified by their immense talent in the studio and on stage.\n\n—ssaa10decYellow - Kang DanielOriginal Album | Romanization | English Translation\nAt 1 AM, I dive straight into this project with no prior knowledge of who KANG DANIEL is and with no familiarity with his music. Now, typically yellow is a vibrant color, symbolizing happiness and joy. However, it seems something dark lurks beneath the surface of this color’s pretense - “yellow” has lost sight of its color and its purpose. What is left is a story that begins with “Digital,” an astounding intro that gives off The Weeknd-esque vibes. Although it has an upbeat feel, it details the troubles of social media and – thanks to some handy research - specifically the false rumors surrounding Kang before he went on hiatus in November 2019. Moving onto “PARANOIA,” the heavy strums of the bass guitar combined with the distorted synth sounds link to his fragmented state of mind. No wonder it was released as a single - it scratches the surface of his darkness, preparing us to venture deeper into his mind. Though melancholy, Kang never shies away from drawing from personal experiences, ensuring his songs are relatable to listeners. “Misunderstood” does exactly that, whilst also marking his first collaboration with rapper Omega Sapien from Balming Tiger, whose voice meshes remarkably well with Kang’s. Personally, “Antidote” is my favorite track. Utilizing a perfect amount of autotune, Kang desperately holds out faith and hope for better days, no matter how hard life treats him. Furthermore, it was written at what Kang cites as “rock bottom,” making it all the more heartfelt for the fans he never stopped thinking about. Finally, “Save U” is a beautifully, optimistic end to the color trilogy. The song, aided by rapper Wonstein, puts into perspective the universal struggles faced both in and out of the spotlight. Overall, the album is vehement, yet eloquent. Truthfully, it is mesmerizing without being enigmatic; its somber mood allows us to focus on the messages Kang succeeds to convey, without any word being lost in translation. Finally, I hope Kang knows how loved he is by his worldwide fans and continues to share his story with such passion!\n—ZealotOfStockholm[&] - LOONAOriginal Album | Romanization | English Translation\nI will admit, I'm a fairly new Orbit. But from the moment I saw the music video for \"Why Not?\", I immediately fell in love with LOONA. And with their newest comeback, [&], my opinion of them only increases. Starting from the intro track, \"&\", the album immediately kicks off with an intense electronic sound. Reusing some elements from the lead single, it's powerful, bold, and sharp. Next is the lead single, \"PTT (Paint The Town)\". With influence from Indian culture and music, this track is has a very intense dance hip-hop sound. LOONA sings about not caring what other people think about you and showing your true colors shamelessly. Showcasing an amazing pre-chorus, and a captivating bridge, with LOONA's vocals, it's an absolutely gorgeous track. After that, we have \"WOW\". A bouncy, upbeat track, LOONA encourages every girl to be proud of who they are, and be themselves without shame. Then, it's \"Be Honest\", my favorite song on the album. A refreshing bop, it's about being honest to yourself and expressing your feelings. In my opinion, LOONA's vocals really shine here, with great melodies and lively raps. Next is the fully English song \"Dance On My Own\". Opening with a simple acoustic guitar, LOONA's vocals have a really nice feel in this song. Then, we have \"A Different Night\" - an emotional ballad with a dreamy, sentimental sound. The ad-libs throughout the song enhance the effect nicely. The album ends with \"U R\", a soft R&B song with lo-fi influence. It's a really good song for chilling in your house at night! Overall, this album transitions very nicely - opening with an intense, powerful intro, and ending with a warm, cozy sound. This is definitely one of my favorite albums, everyone should give it a listen! You'll definitely like at least one track on it!\n\n—crystallized_starstimeabout, - YukikaOriginal Album | Romanization | English Translation\nLet's get one thing out of the way first, Japanese K-pop idol Yukika is my all-time favorite solo artist. She mainly makes city pop songs, a genre inspired by Japanese music made usually in the 1980s. 'timeabout,' is her first mini-album, and in my opinion one of the best mini albums ever released. I'm a sucker for city pop so there was already no way I would've disliked anything on the album. It starts with a synth intro called \"Leap forward\" which makes me feel like I'm time traveling. Then, it leads on to the title track called \"Insomnia\". The song is a groovy and retro track that you would listen to when you're studying. It makes you feel nostalgic and remember memories. \"Lovemonth\" follows after \"Insomnia,\" immediately catching your attention from the addictive and upbeat start and leads you on to the addicting chorus. \"TIME TRAVEL\" has her signature city pop sound on it, a jazzy-ish chorus with sharp vocals. \"Secret\" includes unique melodies that are so unique that it's addicting to listen to. My favorite track on the album, \"PUNG!\" is an easy-to-listen-to song with vocals and an instrumental brought from heaven. It's calm and memorable and I personally love everything about it. When you listen to it with headphones on, it feels like you're floating on clouds. There isn't any reason not to check her out! If you've never listened to city pop before, I promise you that it can easily become your favorite genre. Yukika is a great city pop artist to start off with.\n\n—seokyoungUNNATURAL - WJSNOriginal Album | Romanization | English Translation\nFrom somebody who never listened to WJSN, you might wonder what I listened to, to get into them? It was all because of this album. It all began when my friend recommended this album and shortly, it became one of my favorite albums of all time. This album has many upbeat songs and along with a ballad called \"REWIND\"”. The title song \"UNNATURAL\"\" is a flashy song and has a catchy and fun hook. The second track called \"Last dance\" has an impressive intro with a captivating pizzicato. I personally love the chorus for it as it was stuck in my head for a few days. Moving on to \"SUPER MOON\" is another track with an exciting hook. Member Exy took part in writing the rap lyrics which makes it more exciting to listen to. The fourth track in the album titled \"New Me\" has to be my favorite track on there. With an ambitious message, It’s an extremely captivating retro track that you can never get bored of. I really like retro songs therefore I really loved it. Members Seola and Exy participated in the making of the song. Moving on to the fifth track in the album \"YALLA\" once again, member Exy wrote AND composed this song. What a talented girl! Another one of my favorite tracks on the album, \"YALLA,\" is an electronic pop song with a hard-hitting drop in its chorus. The last song on the album which is \"REWIND\" is a great ballad. Containing the lyrics \"We will be together forever\" it is a very meaningful song. Both promoted tracks, \"UNNATURAL\" and \"Last Dance\" also have beautiful choreographies. In general, the whole album is really fun with memorable hooks and lyrics. So whenever you’re planning on having a party or doing karaoke, you should try playing this album. I really recommend that you listen to this album if you haven't already as you would definitely be impressed.\n\n—WongkaheiDUALITY - I.MOriginal Album | Romanization | English Translation\nYes, he served us looks, a fiery flow, and some questionable lyrics, but underneath all that, I.M of MONSTA X delivered some of the most vulnerable moments on his mixtape, DUALITY. Sticking to the theme of the project, Changkyun shares how there are always two sides to a story. He expresses how every emotion whether good or bad has multiple sides to it. The mixtape was promoted with the smooth hip-hop lead single, “God Damn.” In line with the concept, I.M masterfully cloaks the song with explicit lyrics and sexual innuendos but also manages to add deeper self-reflective layers to it. “Howlin’” finds I.M once again dealing with conflicting feelings about being alone. Known as a sexy R&B crooner, I.M takes a much darker route on “Burn” and “Happy To Die” talking about mental health and the toll that his glamorous idol life takes on him. The album’s resident melodic rap ballad, “시든 꽃 (Flower-ed)” is a somber track written from the perspective of the person left behind after a relationship withers away. With DUALITY, I.M shows a different side to himself. The mixtape highlights his strengths as a rapper and a songwriter. Oftentimes, I.M’s sincerity is lost behind their hard-hitting verses in MONSTA X songs, which is why DUALITY is an even more special project because it allowed him to open himself up to his fans and audience and put himself in a different light.\n\n—ssaa10decNOIR - U-KNOW Original Album | Romanization | English Translation\nI’m a big TVXQ! fan, my IQ on both TVXQ! & TOHOSHINKI is over 3000, that aside I really love this album. I love the robotic feeling of the opening track Time Machine and his harmonization with those “Ah-a-a-a-a-a-ah” make his robotic voice pop. Up comes most likely my favorite track off the album Thank U first off I love the MV with the elevator fight scene, him slashing everyone and the border falling, the One-In-The-Chamber scene and how cinematic the whole vibe is. The song is also great, I like the first part of the instrumental where it’s gloomy and it sounds amazing. As well as the dynamic in his voice where he is singing then he’s sounds more further away and more sad. Also the solo sax part is just ear candy. Onto the next track Eeny Meeny is a really good pace changer, from being quite tense to being playful and the instrumental after the second chorus is my favorite part and goes back to the normal instrumental seamlessly. Eeny Meeny made one thing strong a fun vibe and Loco House Party made that theme much more clearer. Having a tropical and fun vibe is honestly great but there is no standout moment in the track. You know the theme that Eeny Meeny made and Loco House Party expanded on? Being upbeat and fun? Need You Right Now just throws that out the window but It’s a nice track and is a good ballad-ishy song. But the track suffers from the same flaw as the last one, no stand out moments. The theme Need You Right Now stopped it actually made another being ballad-ish sounding songs or sounding more sad with La Rosa but the last 3 tracks all suffer from the same thing “Not Having A Standout Moment.” And that’s a big flaw no track is bad mind you but the first 3 make a really good start but then has a bit of a slump. But the biggest flaw is that there’s no theme throughout the whole album. . . But it is my favorite K-Pop album of the year so… A+\n\n-OKRA233Embed"
    }
}