{
    "id": "ML525",
    "mood": "angry",
    "artist": "Nas",
    "title": "Ether",
    "song": {
        "_type": "song",
        "annotation_count": 90,
        "api_path": "/songs/225",
        "artist_names": "Nas",
        "full_title": "Ether by Nas",
        "header_image_thumbnail_url": "https://images.genius.com/b568e8d559c7ba98ef485809d81c1d79.300x300x1.jpg",
        "header_image_url": "https://images.genius.com/b568e8d559c7ba98ef485809d81c1d79.1000x1000x1.jpg",
        "id": 225,
        "instrumental": false,
        "language": "en",
        "lyrics_owner_id": 2,
        "lyrics_state": "complete",
        "lyrics_updated_at": 1672958920,
        "path": "/Nas-ether-lyrics",
        "pyongs_count": 171,
        "relationships_index_url": "https://genius.com/Nas-ether-sample",
        "release_date_components": {
            "year": 2001,
            "month": 12,
            "day": 4
        },
        "release_date_for_display": "December 4, 2001",
        "release_date_with_abbreviated_month_for_display": "Dec. 4, 2001",
        "song_art_image_thumbnail_url": "https://images.genius.com/b568e8d559c7ba98ef485809d81c1d79.300x300x1.jpg",
        "song_art_image_url": "https://images.genius.com/b568e8d559c7ba98ef485809d81c1d79.1000x1000x1.jpg",
        "stats": {
            "unreviewed_annotations": 4,
            "concurrents": 2,
            "hot": false,
            "pageviews": 1649081
        },
        "title": "Ether",
        "title_with_featured": "Ether",
        "updated_by_human_at": 1672958919,
        "url": "https://genius.com/Nas-ether-lyrics",
        "featured_artists": [],
        "primary_artist": {
            "_type": "artist",
            "api_path": "/artists/56",
            "header_image_url": "https://images.genius.com/db014f5e4f9c6e873e7c6e8ec7d1a76b.1000x624x1.jpg",
            "id": 56,
            "image_url": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg",
            "index_character": "n",
            "is_meme_verified": true,
            "is_verified": true,
            "name": "Nas",
            "slug": "Nas",
            "url": "https://genius.com/artists/Nas",
            "iq": 40988
        },
        "artist": "Nas",
        "lyrics": "Ether Lyrics[Produced by Ron Browz]\n[Intro]\nFuck Jay-Z\nWhat's up, niggas?\nAyo, I know you ain't talkin' about me, dawg (You? What?)\nFuck Jay-Z\nYou been on my dick, nigga\nYou love my style, nigga (Uh, uh, uh, uh)\nFuck Jay-Z\n[Chorus]\n(I) Fuck with your soul like ether\n(Will) Teach you, the king, you know you\n(Not) God's Son across the belly\n(Lose) I'll prove you lost already (Uh)\n\n[Verse 1]\nBrace yourself for the main event, y'all impatiently waitin'\nIt's like a AIDS test, what's the results?\nNot positive, who's the best, Pac, Nas and B.I.G.?\nAin't no best, east, west, north, south, flossed out\nGreetings, I embrace y'all with napalm\nBlows up, no guts left, chest, face gone\nHow could Nas be garbage? Semi-autos at your cartilage (Uh)\nBurner at the side of your dome, come out of my throne\nI got this locked since '91 (Uh), I am the truest\nName a rapper that I ain't influenced\nGave y'all chapters, but now I keep my eyes on the Judas\nWith Hawaiian Sophie fame, kept my name in his music, check it\n\n[Chorus]\n(I) Fuck with your soul like ether\n(Will) Teach you, the king, you know you\n(Not) God's Son across the belly (Haha)\n(Lose) I'll prove you lost already (Uh)\nYou might also like[Interlude]\nAyo, pass me the weed (Tsk, there you go)\nPut my ashes out on these niggas, man (Ain't no doubt)\nAyo, you faggots, y'all kneel and kiss the motherfuckin' ring\n[Chorus]\n(I) Fuck with your soul like ether\n(Will) Teach you, the king, you know you\n(Not) God's Son across the belly\n(Lose) I'll prove you lost already\n\n[Verse 2]\nI've been fucked over, left for dead, dissed and forgotten\nLuck ran out, they hoped that I'd be gone, stiff and rotten\nY'all just piss on me, shit on me, spit on my grave (Uh)\nTalk about me, laugh behind my back, but in my face\nY'all some well-wishin' (Bitch niggas), friendly-actin', envy-hidin' snakes\nWith your hands out for my money, man, how much can I take?\nWhen these streets keep callin', heard it when I was sleep\nThat this Gay-Z and Cock-a-Fella Records wanted beef (What?)\nStarted cockin' up my weapon, slowly loadin' up this ammo\nTo explode it on a camel (Haha) and his soldiers I can handle\nThis for dolo and his manuscript just sound stupid\nWhen KRS already made a album called Blueprint (Dick)\nFirst Biggie's your man, then you got the nerve to say\nThat you better than B.I.G., dick-suckin' lips (Ha)\nWhy don't you let the late, great veteran live?\n[Interlude]\nI will\nNot lose (God's son across the belly, I'll prove you lost already), uh\nThe king is back\nWhere my crown at? (Ill Will)\nIll Will, rest in peace, let's do it, niggas\n\n[Chorus]\n(I) Fuck with your soul like ether\n(Will) Teach you, the king, you know you\n(Not) God's Son across the belly\n(Lose) I'll prove you lost already\n[Verse 3]\nY'all niggas deal with emotions like bitches\nWhat's sad is I love you 'cause you're my brother, you traded your soul for riches\nMy child, I've watched you grow up to be famous\nAnd now I smile like a proud dad watchin' his only son that made it\nYou seem to be only concerned with dissin' women\nWere you abused as a child? Scared to smile, they called you ugly?\nWell, life is harsh, hug me, don't reject me\nOr make records to disrespect me, blatant or indirectly\nIn '88 you was gettin' chased through your building\nCallin' my crib and I ain't even give you my numbers\nAll I did was give you a style for you to run with\nSmilin' in my face, glad to break bread with the God\nWearin' Jaz' chains, no TECs, no cash, no cars\nNo jail bars, Jigga, no pies, no case\nJust Hawaiian shirts, hangin' with little Chase\nYou a fan, a phony, a fake, a pussy, a Stan\nI'll still whip your ass, you thirty-six in a karate class?\nYou Tae-Bo ho, tryna work it out, you tryna get brolic?\nAsk me if I'm tryna kick knowledge?\nNah, I'm tryna kick the shit you need to learn, though\nThat ether, that shit that make your soul burn slow (Burn slow)\nIs he Dame Diddy, Dame Daddy or Dame Dummy?\nOh, I get it, you Biggie and he's Puffy (Ill)\nRocafella died of AIDS, that was the end of his chapter\nAnd that's the guy y'all chose to name your company after?\nPut it together, I rock hoes, y'all rock fellas\nAnd now y'all tryna take my spot, fellas?\nFeel these hot rocks, fellas, put you in a dry spot, fellas\nIn a pine box with nine shots from my Glock, fellas\nFoxy got you hot 'cause you kept your face in her puss\nWhat you think, you gettin' girls now 'cause of your looks? (Girls, girls, girls, haha)\nNegro, please, ha, you no-mustache-havin'\nWith whiskers like a rat, compared to Beans, you wack\nAnd your man stabbed Un and made you take the blame\nYou ass, went from Jaz to hangin' with Kane, to Irv, to B.I.G\nAnd Eminem murdered you on your own shit\nYou a dick-ridin' faggot, you love the attention\nQueens niggas run you niggas, ask Russell Simmons, ha\nR-O-C get gunned up and clapped quick\nJ.J. Evans get gunned up and clapped quick\nYour whole damn record label, gunned up and clapped quick\nShawn Carter to Jay-Z, damn, you on Jaz dick\nSo little Shawny's gettin' gunned up and clapped quick\nHow much of Biggie's rhymes is gon' come out your fat lips? (Nigga)\nWanted to be on every last one of my classics\nYou pop shit, apologize, nigga, just ask Kiss171Embed"
    }
}