{
    "id": "ML980",
    "mood": "angry",
    "artist": "Nas",
    "title": "One Mic",
    "song": {
        "_type": "song",
        "annotation_count": 23,
        "api_path": "/songs/490",
        "artist_names": "Nas",
        "full_title": "One Mic by Nas",
        "header_image_thumbnail_url": "https://images.genius.com/c47b115fd5b2e081e89d5d9e8fb9e91b.300x299x1.jpg",
        "header_image_url": "https://images.genius.com/c47b115fd5b2e081e89d5d9e8fb9e91b.350x349x1.jpg",
        "id": 490,
        "instrumental": false,
        "language": "en",
        "lyrics_owner_id": 157,
        "lyrics_state": "complete",
        "lyrics_updated_at": 1666690048,
        "path": "/Nas-one-mic-lyrics",
        "pyongs_count": 55,
        "relationships_index_url": "https://genius.com/Nas-one-mic-sample",
        "release_date_components": {
            "year": 2001,
            "month": 12,
            "day": 18
        },
        "release_date_for_display": "December 18, 2001",
        "release_date_with_abbreviated_month_for_display": "Dec. 18, 2001",
        "song_art_image_thumbnail_url": "https://images.genius.com/c47b115fd5b2e081e89d5d9e8fb9e91b.300x299x1.jpg",
        "song_art_image_url": "https://images.genius.com/c47b115fd5b2e081e89d5d9e8fb9e91b.350x349x1.jpg",
        "stats": {
            "unreviewed_annotations": 2,
            "hot": false,
            "pageviews": 386130
        },
        "title": "One Mic",
        "title_with_featured": "One Mic",
        "updated_by_human_at": 1666690048,
        "url": "https://genius.com/Nas-one-mic-lyrics",
        "featured_artists": [],
        "primary_artist": {
            "_type": "artist",
            "api_path": "/artists/56",
            "header_image_url": "https://images.genius.com/db014f5e4f9c6e873e7c6e8ec7d1a76b.1000x624x1.jpg",
            "id": 56,
            "image_url": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg",
            "index_character": "n",
            "is_meme_verified": true,
            "is_verified": true,
            "name": "Nas",
            "slug": "Nas",
            "url": "https://genius.com/artists/Nas",
            "iq": 40988
        },
        "artist": "Nas",
        "lyrics": "One Mic Lyrics[Produced by Chucky Thompson and Nas]\n\n[Intro]\nOne time\nYeah, yeah\n\n[Verse 1]\nYo, all I need is one mic, one beat, one stage\nOne nigga front, my face on the front page\nOnly if I had one gun, one girl and one crib\nOne God to show me how to do things his son did\nPure, like a cup of virgin blood\nMixed with 151, one sip'll make a nigga flip\nWritin' names on my hollow tips, plottin' shit\nMad violence, who I'm gon' body? This hood politics\nAcknowledge it, leave bodies chopped up in garbages\nSeeds watch us, grow up and try to follow us\nPolice watch us, roll up and try knockin' us\nOne knee, I ducked, could it be my time is up?\nBut my luck, I got up, the cop shot again\nBus stop glass burst, a fiend drops his Heineken\nRicochetin' between the spots that I'm hidin' in\nBlackin' out as I shoot back, fuck gettin' hit\nThis is my hood, I'ma rep to the death of it\n'Til everybody come home, little niggas is grown\nHoodrats, don't abortion your womb\nWe need more warriors soon, sent from the stars, sun and the moon\nIn this life of police chases, street sweepers and coppers\nStick-up kids with no conscience leavin' victims with doctors\nIf you really think you ready to die with nines out\nThis is what Nas is 'bout, nigga, the time is now\n[Chorus]\nYo, all I need is one mic\nAll I need is one mic (That's all I need)\nAll I need is one mic (All I need, niggas)\nAll I need is one mic (Yeah)\n\n[Verse 2]\nAll I need is one blunt, one page and one pen\nOne prayer, tell God forgive me for one sin\nMatter fact, maybe more than one\nLook back at all the hatred against me, fuck all of them\nJesus died at age thirty-three, there's thirty-three shots\nFrom twin Glocks, there's sixteen apiece, that's thirty-two\nWhich means one of my guns was holdin' seventeen\nTwenty-seven hit your crew, six went into you\nEverybody gotta die sometime, hope your funeral\nNever gets shot up, bullets tear through the innocent\nNothin' is fair, niggas roll up shootin' from wheelchairs\nMy heart is racin', tastin' revenge in the air\nI let this shit slide for too many years, too many times\nNow I'm strapped with a couple of MACs, two mini nines\nIf y'all niggas really with me, get busy, load up the semis\nDo more than just hold it, explode the clip until you empty\nThere's nothin' in our way, they bust, we bust, they rush, we rush\nLead flyin', feel it? I feel it in my gut\nThat we take these bitches to war, lie 'em down\n'Cause we stronger now, my nigga, the time is now\nYou might also like[Chorus]\nAll I need is one mic (That's all I need, niggas, that's all I need)\nAll I need is one mic (There's nothin' else in the world)\nAll I need is one mic (That's all a nigga need to do his thing, you know?)\nAll I need is one mic (This is all I need)\n\n[Verse 3]\nAll I need is one life, one try, one breath, I'm one man\nWhat I stand for speaks for itself, they don't understand\nDon't wanna see me on top, too egotistical\nTalkin' all that slick shit the same way these bitches do\nWonder what my secrets is, niggas'll move on you\nOnly if they know what your weakness is, I have none\nToo late to grab guns, I'm blastin' 'cause I'm a cool nigga\nThought I wouldn't have that ass done? Fooled you niggas\nWhat you call an infinite brawl, eternal souls clashin'\nWar gets deep, some beef is everlastin'\nComplete with thick scars\nBrothers knifin' each other up in prison yards\nDrama, where does it start?\nYou know the block was ill as a youngster\nEvery night it was like a cop'll get killed, body found in a dumpster\nFor real a hustler, purchased my Range, niggas throwin' dirt on my name\nJealous 'cause fiends got they work and complained\nBitches left me 'cause they thought I was finished\nShoulda knew she wasn't true, she came to me when her man caught a sentence\nDiamonds are blindin', I never make the same mistakes\nMovin' with a change of pace, lighter load, see now the king is straight\nSwellin' my melon 'cause none of these niggas real\nHeard they were tellin' police, how can a kingpin squeal?\nThis is crazy, I'm on the right track, I'm finally found\nYou need some soul-searchin', the time is now\n[Chorus]\nAll I need is one mic (Yeah, yeah, yeah, yeah)\nAll I need is one mic (All I ever needed in this world, fuck cash)\nAll I need is one mic (Fuck the cars, the jewelry)\nAll I need is one mic (To spread my voice to the whole world, baby)55Embed"
    }
}